{
    "data": "Rövid kérdések!\n-----\n0. • Mit derı́tettek ki a pitagóreusok a racionális számok és a húros hangszerek viszonyáról?\nA pitagóreusok szerint a racionális számok aránya meghatározó a hangszerek hangjának arányaihoz képest. Ezt az arányt pedig egyszerű egész számokkal lehet kifejezni. Ezáltal a pitagóreusok nagyban hozzájárultak a zenei hangolás elméletéhez.\n-----\n1. • Mit jelölt meg az arisztotelészi mechanika annak okául, hogy az elengedett kő lefele esik?\nAz arisztotelészi mechanika szerint az elengedett kő lefele esik, mert az anyagok természetesen törekednek a földhöz vonzódni, és a föld a súlyt vonzza magához. Ez a gravitáció törvénye.\n-----\n2. • A tanult nagy civilizációk közül hol alkalmaztak először kezdetleges helyiértékes számábrázolást?\nA sumerek az elsők, akik használtak helyiértékes számábrázolást az i. e. 4. évezredben. Az ő számrendszerük a hatvanas számrendszer volt, amely a mai időkig is használatban van az időmérésben és szöveges számjegyzékben.\n-----\n3. • Melyik az a 4 alapelem, melyből az ókori görög gondolkozók többsége szerint a világ felépül?\nAz ókori görög gondolkozók többsége szerint a világ a levegő, a viz, a föld és a tűz nevezőjéből építünk fel. Ezért ezeket az elemeket nevezték az alapelemeknek. Az ókori görög mítoszokban ezért is gyakran találkozhatunk ezekkel az elemekkel.\n-----\n4. • Ki volt az első a tanult csillagászok közül, aki mérésekkel bizonyı́totta, hogy a Nap nagyobb, minta Föld? Milyen következtetésre jutott ebből?\nGiordano Bruno volt az első csillagász, aki megállapította, hogy a Nap nagyobb, mint a Föld. Ebből a következtetésből arra jutott, hogy a Föld nem lehet az univerzum központja.\n-----\n5. • Mit tudtak az ókori görögök a Föld alakjáról és méretéről?\nAz ókori görögök úgy gondolták, hogy a Föld lapos és kör alakú. Az első pontos mértékét Eratoszthenész végezte el a Kr.e. 3. században.\n-----\n6. • Mit állı́tott az arisztotelészi mechanika azokról a testekről, melyeket felgyorsı́tottunk, de azután minden erőhatástól szabaddá váltak? Mi a valóság?\nAz arisztotelészi mechanika szerint egy test csak akkor mozog tovább, ha valamilyen erő hat rá. Azonban a modern fizika szerint az ilyen testek mozgása inerciájuk miatt folytatódik, amely az anyag tömegével arányos. Ez az inercia megakadályozza azonnali megállásukat, ha az erők hatása megszűnik.\n-----\n7. • Mi a legfontosabb fizikai hatás, melynek figyelmen kı́vül hagyása téves mozgástövényekre vezetteaz ókori görög gondolkozókat?\nAz ókori görög gondolkozók a gravitaciós erő hatasát nem vették figyelembe, ezért hiányzott a téves mozgástövények és az általuk kiváltott mozgási zavarok megértése. Az ókori görög földrajzi és csillagászati megfigyelések azonban elősegítették a mozgás törvényeinek megértését.\n-----\n8. • Milyen megfontolásból gondolták az ókori görögök, hogy az égi mozgások körpályákon vagy azokkombinációin kell, hogy történjenek?\nAz ókori görögök azt feltételezték, hogy az égitestek mozgása tökéletes és harmonikus, amihez a körmozgás a legmegfelelőbb. Emellett a körmozgásnak isteni jelentősége is volt, hiszen a görög mitológiában a kör a teljességet és az örök életet jelképezte.\n-----\n9. • Milyen magyarázatot adott Eudoxosz arra, hogy a bolygók a Földről nézve néha változó irányúmozgást végeznek?\nEudoxosz szerint a bolygók mozgása a Nap és a Föld közötti viszonylagos pozíciójuk változására vezethető vissza, amely befolyásolja az égi testek látható mozgását az égbolton. Ez magyarázza a bolygók néha változó irányú mozgását a Földről nézve.\n-----\n10. • Miért ptolemaioszi-rendszer néven ismert a földközéppontú világkép, amikor nem is ő fedezte fel azt?\nA ptolemaioszi rendszer a görög tudós, Ptolemaiosz munkásságára alapozódik, aki azonban nem fedezte fel a földközpontú világképet, csak továbbfejlesztette azt. Az elnevezés azért terjedt el, mert Ptolemaiosz rendszerét tartották a legkidolgozottabb és legelterjedtebbnek a középkorban és a reneszánszban.\n-----\n11. • Mi volt Arisztarkhosz Föld-Hold távolságmérésének ötlete? Kb. milyen értéket kapott?\nArisztarkhosz a Hold és a Nap közötti szöget mért meg, majd ebből kiszámította a Föld-Hold távolságot. Az általa számolt érték kb. 400 000 km volt.\n-----\n12. • Mi volt az alapötlete az első Föld-Nap távolságmérésnek? Ki végezte ezt el?\nAz alapötletet Hipparchusnak köszönhetjük, aki az ókori Görögországban élt. Az ő munkája alapján sikerült először megközelítőleg meghatározni a Föld és a Nap közötti távolságot.\n-----\n13. • Kik fedezték fel, hogy a négyzet átlója nem fejezhető ki az oldalhossz racionális számszorosával?\nKik realized that the diagonal of a square cannot be expressed as a rational multiple of its side length.\n-----\n14. • Írjon le legalább 2 olyan szerkesztési problémát, melyet az ókori görögök nem tudtak megoldaniEuklidesz geometriája alapján!\n1. Az ókori görögök nem tudtak megtalálni a kör és a negyedkör területének pontos mérésményeit, mivel nem voltak olyan algebrai mészerek, amelyekkel pontosan meghatározhatták volna a pi szam értékét.\n2. Nem sikerült megtalálniuk a részleges felső-korona területének pontos mérésményeit, ami egy kör feletti szelet mérését jelenti, mivel a köri szektorok területének meghatározásához szükséges volt az összeszínításhoz használt szög pontos meghatározása, ami csak nagyon közelitő mértékű lehetett.\n-----\n15. • Ki volt az a görög matematikus, aki az addigi geometriai ismereteket teljes axiomatikus rendszerbeszervezte és leı́rta? Mi könyvének rövidı́tett cı́me?\nEukleidész volt az a görög matematikus, aki az addigi geometriai ismereteket teljes axiomatikus rendszerbe szervezte és leírta. Az általa írt könyv rövidített címe \"Elemek\". Ez a mű azóta is az egyik legbefolyásosabb matematikai mű, amely alapja az Euclid-i geometriának.\n-----\n16. • A kézből elengedett kő lefelé esik. Mit jelölt meg az arisztotelészi mechanika az esés okául?\nArisztotelészi mechanika szerint az esés oka a testek természetes mozgása, amely az őket alkotó 4 elem (föld, víz, tűz, levegő) szerint meghatározott. A kő esése a föld elemhez kapcsolódik, amelynek természetes mozgása a lefelé tartó mozgás.\n-----\n17. • Milyen fontos és meglepő tételt bizonyı́tottak be a pitagoreusok az egységnégyzet átlójával kapcso-latban?\nA pitagoreusok bebizonyították, hogy az egysegnégyzet átlója megegyezik a négyzet oldalainak összegével. Ez a Pitagoras-tétel alapja.\n-----\n18. • Az arisztotelészi fizika szerint milyen tı́pusú mozgást végez a toll, amivel ezt a dolgozatot ı́rja?Miért?\nAz arisztotelészi fizika szerint a toll állandó mozgást végez, amelyet \"hordozó mozgásnak\" neveznek, mivel a toll mozgása az író kezének mozgásával párhuzamosan történik. Ez a mozgás a gravitáció hatása alatt áll, amely a tollat a papír felé húzza.\n-----\n19. • Hogyan jelölte az ókori görög tudósok nagy része az egész számokat?\nAz ókori görög tudósok közül nagy része egyszerű aritmetikai műveletekkel, mint összeadás, kivonás, szorzás és osztás, jellemezte az egész számokat. A legismertebb matematikusok közül Pythagoras és Platón számmisztikai és filozófiai értelemben vélték fontosnak az egész számokat.\n-----\n20. • Ki és kb. mikor adta meg először a gömb és a kúp térfogatszámı́tási módszerét helyesen?\nA görög matematikusok, mint Archimedes és Eukleidész már az ókorban ismerték a gömb és a kúp térfogatszámítási módszerét. Archimedes a gömb térfogatát megadó számot 225/73 és 3+10/71 közé becsülte. Eukleidész a kúp térfogatát képletek segítségével számolta ki.\n-----\n21. • Írja fel mezopotámiai jelölésekkel a 99-es számot! Milyen más számnak lehet ezt elvileg olvasni,ha nem tudjuk fejből a szám nagyságrendjét?\nMezopotámiában a 99-et XCIX-ként írták. Ha nem ismerjük a sorszám nagyságrendjét, akkor a XCIX-t elvileg lehet olvasni kilencvenkilenc, vagy kilenc plusz kilencven, vagy kilencven plusz kilenc.\n-----\n22. • Hogyan jelölték az ókori görögök a pozitı́v egész számokat? Egyértelmű volt ez a jelölés? (Egyszámot csak egyféleképp ı́rhattak le?) Miért?\nAz ókori görögök a pozitív egész számokat betűkkel jelölték, amelyeknek a nevei a számokat jelölték. Ez a jelölés nem volt egyértelmű, mivel többféle betűvel is jelölhették ugyanazt a számot. Ez azért volt így, mert az ókori görög betűknek nincs számértéke.\n-----\n23. • Nevezzen meg két jelenséget, melyek megfigyelése alapján az ókori görögök már tudták, hogy aFöld gömb alakú!\nAz ókori görögök észlelték, hogy a csillagok pozíciója változik a horizonton, ahogy az ember elmozdul a Föld felszínén. Emellett a görög filozófusok megfigyelték, hogy a Föld árnyéka a Holdon kerek alakú, ami arra utal, hogy a Földnek gömb alakja van.\n-----\n24. • Miért vetődött fel már az ókorban annak az ötlete, hogy a Merkúr és a Vénusz a Nap körül kerin-genek?\nAz ókorban az emberek úgy gondolták, hogy a Nap és a csillagok az égbolton mozognak, és a Föld áll. Ezért nem fogadták el az ötletet, hogy a Merkúr és a Vénusz a Nap körül keringenek. Ezenkívül az is megnehezítette az elfogadásukat, hogy az általuk ismert fizikai törvényekkel nem tudták magyarázni az ilyen mozgást.\n-----\n25. • Egy régi könyvtöredékben ezt látjuk leı́rva: π = 3, 14159”. Lehet-e ez Klaudiosz Ptolemaiosz egy műve? Miért? (2 indokot is ı́rjon!)\nNem lehet Klaudiosz Ptolemaiosz műve, mert az ő korában a görög matematikusok és tudósok már ismerték a π pontosabb értékét. Emellett Ptolemaiosz műveiben semmilyen utalás nincs arra, hogy ilyen pontatlan értéket használt volna.\n-----\n26. • Mit állı́tott az arisztotelészi mechanika azokról a testekről, melyeket felgyorsı́tottunk, de azutánminden erőhatástól szabaddá váltak? Mi a valóság?\nAz arisztotelészi mechanika azt állította, hogy a felgyorsított testek mozgása csak az erő hatására folytatódik. Azonban a valóságban a testeknek van inerciájuk, azaz a mozgásuk folytatódik a hatás megszűnése után is. Ez a Newton-féle mozgástan alapelve.\n-----\n27. • Miért ptolemaioszi-rendszer” néven ismert a földközéppontú világkép, amikor nem is ő fedezte fel azt?\nA Ptolemaioszi rendszer nevet Ptolemaiosz görög asztrofizikusról kapta, aki az ókorban általánosan elfogadott modellt továbbfejlesztette és részletesen leírta. A modell szerint a Föld a világegyetem középpontja, körülötte keringnek a bolygók és a Nap. Bár Ptolemaiosz nem fedezte fel a rendszert, a munkája jelentős hatással volt a középkori és reneszánsz asztrológiára.\n-----\n28. • Miért ptolemaioszi-rendszer” néven ismert a földközéppontú világkép, amikor nem is ő fedeztefel azt?\nAzért nevezik Ptolemaioszi-rendszernek, mert a görög tudós, Ptolemaios kidolgozta és részletesen leírta a rendszert. Azonban az alapötlet már korábban is létezett, és más tudósok is dolgoztak hasonló modellekkel. A rendszer neve tehát inkább a kidolgozásának és terjedésének köszönhető.\n-----\n29. • Adjon meg egy nevet az ókorból és egyet az 1500-as évekből, akik elképzelhetőnek tartották a FöldNap körüli keringését! Milyen kapcsolat van közöttük?\nÓkor: Aristarchus - Az ókori görög filozófus és tudós úgy gondolta, hogy a Föld kering a Nap körül.\n\n1500-as évek: Nicolaus Copernicus - A lengyel asztronómus úgy tette közzé elméletét, hogy a Nap a középpont, és a Föld és a többi bolygó kering körülötte. Nincs közvetlen kapcsolat azonban Aristarchus és Copernicus között.\n-----\n30. • Honnan származik az algoritmus” szó?\nAz algoritmus szó az arab al-Khwarizmi nevéből származik, aki a középkorban matematikus és csillagász volt. A neveből alakult ki az al-jabr szó is, ami az algebra eredeti neve. Az algoritmus szó jelentése: \"Al-Khwarizmi műveletei\" volt.\n-----\n31. • Írja le, mely főbb civilizációkon keresztül jutott el a tı́zes számrendszerű számjelölés Európába! (3közvetı́tő)\nA tizedes számrendszer a hindu civilizációban keletkezett, majd az arabok átvették és fejlesztették tovább. Az arabok által terjesztett számrendszer a középkori Európában terjedt el, és máig használatban van.\n-----\n32. • Kinél és milyen néven bukkan fel először a tömeg és sebesség szorzata, mint fontos mechanikamennyiség?\nA tömeg és sebesség szorzata, mint fontos mechanikai mennyiség először Galileo Galilei-nek az általános mozgási törvényében bukkant fel. Ezt az összefüggést nevezzük impulzusnak, és a tömeg és sebesség mellett a mozgás irányát is figyelembe veszi. Az impulzus fontos szerepet játszik a fizikában, például a lökések és ütközések leírásában.\n-----\n33. • Beeckman 1618-as könyvében egy újszerű magyarázatot adott a szabadesés hely-idő függvényére.Mi volt a nagy újszerűség a magyarázatban?\nBeeckman újszerű magyarázata szerint a szabadesés sebessége idővel arányosan növekszik, és a levegőellenállás hatását is figyelembe veszi. Ez az első részletes és pontos leírása volt a szabadesésnek.\n-----\n34. • Ki jött rá először, hogy az elhajı́tott testek parabolapályán mozognak, ha a közegellenállás elhanya-golható?\nIsaac Newton volt az első, aki megállapította, hogy az elhajított testek parabolapályán mozognak, ha a közegellenállás elhanyagolható.\n-----\n35. • Miért találta Galilei célszerűbbnek a lejtőn guruló testek mozgásának részletes vizsgálatát a szaba-don esőkénél?\nGalilei azt tapasztalta, hogy a lejtőn guruló testek mozgása egyszerűbb és jobban előrejelezhető, mint a szabadon eső testeké, így ezeket könnyebb volt részletesen vizsgálnia és törvényeket felállítania a mozgásukra vonatkozóan.\n-----\n36. • Mondjon egy szempontot, melyben Galilei túllép az arisztotelészi mechanikán!\nGalilei túllép az arisztotelészi mechanikán abban a szempontban, hogy a mozgásokat nem csak természetfölötti erők hatásai alapján magyarázza, hanem a fizikai törvények és az erőhatások alapján is. Emellett bevezeti a relativitás fogalmát is, ami azt jelenti, hogy a mozgások relatívak, nem abszolútak.\n-----\n37. • Mondjon egy szempontot, melyben Galilei nem lép túl az arisztotelészi mechanikán!\nGalilei nem foglalkozott az anyagok tulajdonságaival, azok összetételével, valamint a természet alapvető építőelemeivel, mint például a levegővel. Csak az anyagmozgásokkal és azok törvényeivel foglalkozott.\n-----\n38. • Ki mondta ki először, hogy a magukra hagyott testek egyenes vonalú egyenletes mozgást végeznek?\nGalileo Galilei olasz fizikus és csillagász mondta ki először, hogy a magukra hagyott testek egyenes vonalú egyenletes mozgást végeznek, és nem szükséges a mozgás folyamatos fenntartásához erőhatásra. Ez a Galilei-elv alapja a klasszikus fizikának.\n-----\n39. • Mire használta fel Huygens azt, hogy pontosan tanulmányozta az általános alakú lejtőkön valómozgást?\nHuygens felhasználta a lejtőkön való mozgás tanulmányozását a gravitációs erő és a mozgás törvényeinek megértéséhez. Megfigyeléseit később Galilei mozgástanával összefoglalta, amely jelentős hatással volt az új mechanikai tudomány fejlődésére.\n-----\n40. • Miért volt nehéz elfogadni a Föld mozgásának (forgásának és keringésének) tényét Newton előtt?\nMert ebben az időben a tudományos gondolkodás és a vallási hit közötti határvonal még homályos volt, és sokan ragaszkodtak a földi központú világképhez. Emellett a megfigyelési lehetőségek és a tudományos eszközök korlátozottsága is nehezítette az elfogadást.\n-----\n41. • Ki és mikor elevenı́tette fel a középkorban Arisztarkhosz naprendszer-modelljét?\nArisztarkhosz naprendszer-modelljét a középkorban több alkalommal is felidézték, de a reneszánszban kezdett újra előtérbe kerülni. Nicolaus Copernicus a XV. században alapozta meg a heliocentrikus modellt, amely azonban továbbra is használta Arisztarkhosz korábbi elképzeléseit.\n-----\n42. • Mi volt a két fő tudományos ok, ami miatt a kopernikuszi napközéppontú modell nem vált egybőlelfogadottá?\n1. Az egyház hivatalos tanítása a Föld középpontú modellt vallotta és a kopernikuszi modell ellentmondott ennek.\n2. Az emberek érzékelése szerint a Föld áll és a Nap kering körülötte, így a napközpontú modell nem egyértelműen érthető.\n-----\n43. • Milyen téren nevezhetjük objektı́v módon Tycho de Brahe-t minden idők legjobb csillagászának?\nTycho de Brahe-t objektíven az egyik legjobb csillagásznak nevezhetjük, mivel élete során elkészítette a pontos csillagászati ​​megfigyelések egyik legnagyobb adatbázisát, és ezáltal fontos adatokat és ismereteket szolgáltatott a csillagászat fejlődéséhez. Emellett számos új módszert és eszközt is kifejlesztett, amelyeket a mai napig használnak a csillagászati ​​megfigyelések során.\n-----\n44. • Miért volt jelentős, hogy Tycho de Brahe méréssel igazolta egy üstökösről, hogy az távolabb van,mint a Hold?\nTycho de Brahe mérése fontos volt, mert az előző elmélet szerint az üstökök a Hold körüli pályán mozogtak, így az általa mért távolság bizonyította, hogy az üstökösök messzebbi, azaz a csillagok közötti térben mozognak. Ez alapvetően megváltoztatta az akkori világképet és bebizonyította, hogy az égitestek mozgása nem csak a Földhöz kötött.\n-----\n45. • Mi a kapcsolat Tycho de Brahe és Johannes Kepler között?\nTycho de Brahe volt Johannes Kepler mestere és tanácsadója a csillagászati megfigyelések terén. Kepler a Brahe által gyűjtött adatokat használta fel a Naprendszer mozgásának megértéséhez és törvényeinek megalkotásához.\n-----\n46. • Ki és mikor tette közzé felfedezését, mi szerint a bolgyók a Nap körül ellipszispályán keringenek?\nJohannes Kepler német csillagász tette közzé felfedezését a 17. században. Ő állapította meg, hogy a bolygók az ellipszis alakú pályákon keringenek a Nap körül, nem pedig kör alakúakon.\n-----\n47. • Hitt-e Kepler a csillagjóslásban?\nIgen, Kepler a csillagok mozgásának és fényességének megfigyelésével dolgozott, és az általa gyűjtött adatokat felhasználta a csillagok mozgásának és jellemzőinek tanulmányozásához.\n-----\n48. • Ki és mikor alkalmazott először távcsövet csillagászati megfigyelések céljából?\nAz első távcsövet 1608-ban Hans Lippershey holland optikus készítette el, de a csillagászati megfigyelések céljára csak később kezdtek el használni, amikor Galileo Galilei megfigyelte a Jupiter holdjait és a Vénusz fázisait 1609-ben.\n-----\n49. • Miért volt különösen nagy elvi jelentősége, hogy Galilei felfedezte a Jupiter 4 holdját?\nGalilei felfedezése megkérdőjelezte az akkori földközpontú világképet, és igazolta a kopernikuszi heliocentrikus modellt. Ez elősegítette az empirikus megfigyelések és kísérletek fontosságának elismerését a tudományban.\n-----\n50. • Miért furcsa tudománytörténetileg Galilei ragaszkodása a körpályákhoz a Dialogo-ban?\nGalilei ragaszkodása a körpályákhoz azért furcsa tudománytörténetileg, mert az addigi tudományos modellekkel szemben állt, és az Egyház által elfogadott geocentrikus világképet is megkérdőjelezte.\n-----\n51. • Hogyan bukkannak fel a Kepler-törvények Newton egyik fő művében, a Principia-ban?\nA Kepler-törvények Newton azon megfigyeléseiből származnak, hogy a bolygók pályája elliptikus és a Nap a pálya egyik égőpontjában van. Ezeket az alapokat használta Newton a gravitációs erő és a tömegközéppontok számításához, amelyeket a Principia-ban írt le.\n-----\n52. • Ki volt az, aki számszerűen igazolta, hogy a Föld forgásának hatása elhanyagolható a mindenna-pokban? Miért pont ő?\nLeon Foucault, francia fizikus végzett kísérletet, amelyet a Foucault-inga néven ismerünk, és amely kimutatta, hogy a Föld forog. Azért ő volt a megfelelő személy, mert a korabeli technológia lehetővé tette számára a pontos mérési módszerek alkalmazását.\n-----\n53. • Igaz-e, hogy Galilei tudományos szempontból megcáfolhatatlanul igazolta a Nap középpontúvilágkép igazát?\nIgen, Galilei megfigyelései és kísérletei alapján sikerült megcáfolhatatlanul bizonyítania, hogy a Nap a középpontja a Naprendszernek és a bolygók keringése körülötte történik. Ez a heliocentrikus világkép elfogadásához vezetett.\n-----\n54. • Kinek a (téves) elképzelése volt, hogy a bolygókat mágneses erő tartja Nap körüli keringésükben?\nEz a tévhit az ókori görögök és rómaiak tudományos nézetein alapult, akik azt gondolták, hogy az égitesteket valamilyen mágneses erő tartja a Nap körül. Ebben az időben még nem voltak ismertek a gravitációs törvények.\n-----\n55. • Jelen tudásunk szerint mikor és kik rajzoltak fel először olyan ábrát, melyeket mai szóhasználattalhely-idő és sebesség-idő függvényeknek neveznénk?\nAz első hely-idő és sebesség-idő diagramokat Galilei és Descartes alkották meg a 17. században. Ezek az ábrák segítették az embereket a mozgások és az időbeli változások vizualizálásában.\n-----\n56. • Körülbelül mikorról és kiktől származik a mai tizedesvesszős ill. tizedespontos jelölés?\nA tizedesvesszős és tizedespontos jelölés az arab matematikusoktól származik, akik a 10-es számrendszer mellett álltak ki. A mai formája azonban a 17. századi francia matematikusok által lett elfogadva és elterjedt.\n-----\n57. • Miért volt szükséges az általános alakú lejtőkön való mozgás tanulmányozása a pontos ingaórákkészı́téséhez? Kinek a nevéhez fűződik ez a két téma?\nAz általános alakú lejtőn való mozgás tanulmányozása szükséges volt a pontos ingaórák készítéséhez, mivel az ingaórák működésének alapja az inga rezgése, és ehhez pontosan kellett ismerni a mozgásukat. Az ingaórák pontosítását Christiaan Huygens nevéhez kötjük.\n-----\n58. • Írjon egy nevet, aki már Galilei előtt világosan kimutatta, hogy a nehezebb testek nem esnek gyor-sabban, ha a légellenállás elhanyagolható!\nAz angol tudós, John Wilkins, már a 17. században kimutatta, hogy azonos alakú testek ugyanolyan sebességgel esnek, függetlenül tömegüktől. Ezzel elvetette a korábbi elképzeléseket, miszerint a nehezebb testek gyorsabban esnek. Wilkins azonban még nem tudta teljesen elhanyagolni a levegő ellenállását.\n-----\n59. • Kik és kb. mikor rajzolták fel az első út-idő grafikonokat?\nAz első út-idő grafikonokat az 1600-as években Galileo Galilei és Isaac Newton dolgozta ki. Ezek a grafikonok ábrázolják az objektumok mozgását az idő függvényében.\n-----\n60. • Tycho Brahe az 1600-as évek végén minden addiginál pontosabban mérte a bolygópozı́ciókat.Miért és hogyan vezetett ez az ókori eredetű epiciklusok feladásához?\nTycho Brahe a bolygók pontosabb mérésével rájött, hogy azok nem mozognak az ókori elképzelések szerinti epicyclusokon, így feladta ezt a modellt és újabb, pontosabb asztronómiai elméletet dolgozott ki.\n-----\n61. • Ki az a két ember, aki egymással egyidőben, a történelemben először távcsővel tanulmányozta anapfoltokat? Kb. mikor zajlottak ezek a megfigyelések?\nA két ember, akik elsőként tanulmányozták az anapfoltokat, Galileo Galilei és Christoph Scheiner voltak. A megfigyelések a 17. század elején, a napfoltmaximum idején zajlottak. Galileo és Scheiner függetlenül egymástól fedezték fel az anapfoltokat és tanulmányozták azokat.\n-----\n62. • Kit tekinthetünk a koordináta-geometria feltalálójának?\nA koordináta-geometria a geometria egy ága, amelyben a geometriai alakzatokat koordináták segítségével írják le. Az x és y tengely mentén elhelyezkedő pontok és vonalak alkotják a geometriai formákat.\n-----\n63. • Melyik nevezetes műhöz illetve szerzőhöz köthető a módszeres problémamegoldás és az egyenelet-rendezés szabályainak első leı́rása?\nA módszeres problémamegoldás és az egyenelet-rendezés szabályainak első leı́rása a görög matematikus, Euclid nevéhez köthető az \"Elemek\" című művében, amely az ókori görög matematika egyik legjelentősebb alkotása.\n-----\n64. • Ki vezeti be a mechanikába az impetus fogalmát és mit ért alatta? Mit állı́tott felfedezője az impe-tusról, ami nem fért bele a korábbi mechanikai elméletekbe?\nAz impetus fogalmát Jean Buridan vezette be a 14. században, és az a testek mozgásmennyiségét jelenti. Galilei újabb értelmezése szerint az impetus megőrzi a testek mozgását, és ez nem volt összeegyeztethető a korábbi mechanikai elméletekkel.\n-----\n65. • Galilei tanulmányozta a lejtőn guruló golyó mozgástörvényeit és egy érdekes összefüggésre jutottaz egyenletes időközök alatt megtett utakkal kapcsolatban. Hogyan foglamazta meg ezt ő? Igaz ez azösszefüggés?\nGalilei megfigyelte, hogy a lejtőn guruló golyó sebessége arányos az idővel, amit már megtett, és nem a lejtő meredekségével. Ez az összefüggés valóban igaz.\n-----\n66. • Milyen korszakban és területen születtek meg a mai szögfüggvények és az azokkal való számolásszabályai?\nA szögfüggvények és számolási szabályaik a görög geometria és trigonometria fejlődése során alakultak ki az ókori Görögországban, különösen Hipparchosz és Ptolemaiosz munkáinak köszönhetően. Az euklideszi geometria és a trigonometriai táblázatok előrehaladása a középkori iszlám világban és Európában is hozzájárult a fejlődésükhöz.\n-----\n67. • A középkori Európba sok ókori görög filozófus műve nem eredeti görög, és még nem is latinfordı́táson keresztül érkezett meg. Milyen nyelv volt ezeken kı́vül a legfontosabb közvetı́tő̋nyelv?\nA legfontosabb közvetítőnyelv a XII. században az arab volt, amely révén a görög és latin filozófiai szövegek ismertté váltak. A spanyol műfordítók és tudósok jelentős szerepet játszottak az arab művek európai fordításában.\n-----\n68. • Tycho de Brahe a bolygók pozı́cióját 1-2 ı́vperc pontosan tudta megmérni. Miért nem tudott ennélnagyobb pontosságot elérni?\nTycho de Brahe nem tudott nagyobb pontossággal mérni, mert korabeli mérőeszközei és módszerei ezt nem tették lehetővé. A modern technológia lehetővé teszi a bolygók sokkal pontosabb megfigyelését.\n-----\n69. • Miben hasonlı́tott és miben különbözött al-Khwarizmi egyenletrendezési módszere” a maitól?\nAl-Khwarizmi a lineáris egyenletek megoldására használta az algebrai manipulációkat, ami hasonló a mai lineáris algebrai módszerekhez. Azonban a modern matematika számos más módszert és technikát alkalmaz, mint például a mátrixok és a számítógépes algoritmusok.\n-----\n70. • Milyen jelentős felfedezést tett a mozgástanban Leonardo da Vinci?\nLeonardo da Vinci felfedezte, hogy a mozgás során a végtagok és az izmok összehangoltan működnek, és hogy az emberi test mozgása meghatározott geometriai alakzatokat követ. Ezt a felfedezést a későbbi biomechanikai kutatások is megerősítették.\n-----\n71. • A középkori Európba sok ókori görög filozófus műve nem eredeti görög, és még nem is latinfordı́táson keresztül érkezett meg. Milyen nyelv volt ezeken kı́vül a legfontosabb közvetı́tő nyelv?\nAz arab nyelv volt a legfontosabb közvetítő nyelv a középkori Európában, ami segítette az ókori görög filozófia és tudás terjedését a latin világban. Az arabok fordították le és őrizték meg az ókori görög és római műveket, majd ezt követően terjesztették el a nyugati világban.\n-----\n72. • A matematika mely területe volt az, melyben Newton maga is nagy eredményeket ért el és amelyalapvető fontosságú volt a mechanika megalapozásában?\nNewton az analízis területén ért el kiemelkedő eredményeket, amely az általa kifejlesztett differenciál- és integral-szamitási métodókon alapult. Ezen mérvéltek alapján sikerült megalapozni a klasszikus mechanikai elméletet, amely ma is alapjául szolgál a fizikának.\n-----\n73. • Newton nem az F = m · a formában fogalmazta meg hı́res mozgástörvényét. Hogy ı́rná fel maijelülésekkel Newton megfogalmazását?\nNewton a mozgás törvényét a következőképpen fogalmazta meg: \"Egy test nyugvó marad, vagy egyenes vonalú egyenletes mozgást végez addig, amíg a ható erők eredője zérus.\" Azaz, egy test mozgása attól függ, hogy milyen erők hatnak rá, és a mozgás változása arányos az erővel és a test tömegével.\n-----\n74. • Mi Newton azon művének rövidı́tett cı́me, melyben ismerteti alapvető mechanikai felfedezéseit?Mikor jelent meg?\nA cím: Philosophiæ Naturalis Principia Mathematica. Az 1687-ben megjelent mű az alapvető fizikai törvényeket foglalta össze, beleértve az erőhatásokat, az inerciát és a gravitációt.\n-----\n75. • Kinek sikerült először kimutatnia, hogy az égi és földi mozgások azonos törvényszerűségek szerintmennek végbe?\nAz első, aki kimutatta az égi és földi mozgások azonos törvényszerűségeit, az a görög tudós, Arisztarkhosz volt. Ő azonosította azonban a Nap, a Hold és a bolygók mozgását a csillagokhoz képest, és megállapította, hogy a Nap álló pontként jelenik meg az égen, míg a bolygók látszólagos mozgása körülötte zajlik.\n-----\n76. • Írja le szövegesen Newton általános tömegvonzási törvényét!\nA testek közötti gravitációs vonzás erőssége a testek tömegével és távolságuk négyzetével fordítottan arányos.\n-----\n77. • Ki fogalmazta meg a Newton-törvényeket a mai alakjukban?\nSir Isaac Newton, a XVII. századi angol tudós fogalmazta meg a Newton-törvényeket, amelyek a klasszikus mechanika alapját képezik, és a fizikai testek mozgását írják le.\n-----\n78. • Mi volt az első kı́sérleti bizonyı́ték a Föld Nap körüli keringése mellett? (Felfedező nevével ésközelı́tő időponttal együtt.)\nAz első kísérleti bizonyíték a Föld Nap körüli keringése mellett Tycho Brahe dán csillagász munkája volt a 16. században. Brahe megfigyelései azonban nem voltak elegendőek a heliocentrikus modell elfogadásához.\n-----\n79. • Mi volt az első közvetlen kı́sérleti bizonyı́ték a Föld forgására? (Felfedező nevével és közelı́tőidőponttal együtt.)\nAz első közvetlen kísérleti bizonyíték a Föld forgására a Foucault-inga volt, amelyet 1851-ben Jean-Bernard-Léon Foucault francia fizikus készített. Az eszköz segítségével sikerült megfigyelni a Föld forgásának hatását a lengési sík mozgására.\n-----\n80. • Milyen fizikai magyarázatot adott Isaac Newton az általános tömegvonzási törvényére?\nNewton állította, hogy minden test vonzóerővel rendelkezik, amely a testek tömegével arányos, és a testek távolságának négyzetével fordítottan arányos. Ez az erő hatással van minden testre a világegyetemben.\n-----\n81. • Ki adta meg először a kiterjedt, merev testek mozgásának törvényszerűségeit?\nSir Isaac Newton az 1687-ben megjelent \"Philosophiae Naturalis Principia Mathematica\" című művében fogalmazta meg a mozgás törvényeit, amelyek azóta is alapvetőek a fizikában. Newton három törvénye meghatározzák a testek mozgását, beleértve a kiterjedt és merev testeket is.\n-----\n82. • Maupertuis variációs alakban fogalmazta meg a dinamika alaptörvényét, akkor, amikor már a new-toni lokális szemléletű alaptörvény ismert volt. A fizika mely területén ismerhetett Maupertuis ehhezhasonló lokális-variációs alaptörvény-párost? Hogy hı́vjuk ezeket a törvényeket?\nMaupertuis a variációs elv alapján fogalmazta meg a dinamika alapvető törvényét, amely hasonló volt az Euler-Lagrange egyenletekhez, amelyeket a klasszikus mechanikában használnak. Az Euler-Lagrange egyenletek meghatározzák az energia minimális útvonalát a rendszerben.\n-----\n83. • Isaac Newton kiszámolta, hogy ha egy testet egy magas hegycsúcsról elég nagy vı́zszintes se-bességgel dobunk el, az sohasem esik le, hanem keringeni fog a Föld körül. (A közegellenállástóleltekintve.) Milyen ókori elképzelést céfolt meg ezzel? Milyen modern berendezés elvi alapja ez agondolat?\nEzzel az elgondolással céfolt meg az ókori elképzelést, hogy a testeknek mindig le kell esniük a Földre. Az elgondolás modern berendezése a mesterséges holdak és műholdak, amelyek a Föld körül keringenek.\n-----\n84. • Miben hasonlı́t és miben különbözik Descartes és Fermat töréstörvénye?\nMindkét töréstörvény geometriai megközelésére épít, de Descartes által kifejlesztett törésmodell a különböző anyagok törésindexének függevényében meghatározza a törést, míg Fermat elve azt mondja ki, hogy a törést a fény útjának legrövidebb időben történő megtétele alapján lehet meghatározni.\n-----\n85. • Milyen alapvető tévedést fogalmazott meg Pithagorasz a látással kapcsolatban?\nPithagorasz tévesen azt állította, hogy a látás folyamata az, hogy a szemünk kis sugarú sugarakat bocsát ki, amelyek érintik az objektumot, majd a visszaverődő sugarak visszatérnek a szembe, és így látjuk az objektumot. Ez azonban nem igaz, mivel a szemünk csak befogja a fényt, és nem bocsát ki sugarakat.\n-----\n86. • Kinél láthatjuk először a helyes visszaverődési törvény leı́rását?\nA helyes visszaverődési törvény leı́rását épületek építésével foglalkozó szakembérek, építőművészek, építési tervezők és kivállalások használhatják az energiahatékonyság javítása érdekében. Az első ilyen leírások az 1970-es években jelentek meg és azóta számos változata és alkalmazási módja fejlődött ki.\n-----\n87. • Milyen fénytörési törvényt fogalmazott meg Ptolemaiosz? Milyen körülmények közt jelent ez jóközelı́téset, és milyen körülmények közt nagyon pontatlan?\nPtolemaiosz a fénytörényt állandó sebeséggel terjedő fényre alapozta, így jó közelítést ad az optikai törési jelenségek leírásához. Azonban nagyon pontatlan lehet extrém körülmények között, mint például nagy nyomás vagy hőmérséklet változás esetén.\n-----\n88. • Mit adott hozzá optikai ismereteinkhez a középkori arab kultúra?\nA középkori arab kultúra jelentős fejlődést ért el az optikában, felfedezték a lencsék használatának lehetőségét az éleslátás javítására és az astronomiában. Az arab tudósok munkássága nagy hatással volt az európai optikai tudományra.\n-----\n89. • Mikorról származnak az első, mai értelemben szemüvegnek tekinthető szerkezetek?\nAz első, mai értelemben szemüvegnek tekinthető szerkezetek az arab világból származnak, ahol a 11. században készítették el az optikai lencséket. Ezeket először csak az olvasáshoz és íráshoz használták, majd később kifejlesztették a szemüvegkeretet is.\n-----\n90. • A távcső felfedezését milyen nagy elméleti optikai felfedezések előzték meg közvetlenül?\nA távcső felfedezése előtt a lencsék és tükrök optikai tulajdonságait tanulmányozták és fejlesztették ki. A fénytörés és a tükrözés törvényeinek megértése kulcsfontosságú volt a távcső megalkotásához. Galilei és Newton is fontos optikai felfedezéseket tettek, amelyek elősegítették a távcső fejlődését.\n-----\n91. • Ki és kb. mikor vizsgálta először kı́sérletileg a szemet, mint optikai eszközt?\nAz ókori görögök már ismerték az optikai tulajdonságait, és kísérleteztek a lencsékkel. Az első optikai eszközök készítése azonban csak a 13. században kezdődött, amikor a művészek megkezdték a dioptriás lencsék készítését. Az első szemvizsgálatokat a 17. században végezték.\n-----\n92. • Kik a pontos fénytörési törvény felfedezői?\nA pontos fénymérési törvényt Heinrich Hertz, Gustav Kirchhoff és Robert Bunsen fedezte fel. Ez a törvény leírja, hogy az anyagok által kibocsátott és abszorbeált elektromágneses sugárzás intenzitása arányos az anyag hőmérsékletével és a hullámhosszal.\n-----\n93. • Ki adta meg a szemüvegek mai szempontból is helyesnek tekinthető elméletét?\nA szemüvegek mai szempontból helyesnek tekinthető elméletét az optika tudománya adta meg, amely szerint a szemüvegek különböző alakú és vastagságú lencsékből állnak, amelyek a fénysugarakat úgy törnek, hogy a kép a retina helyett az ideghártya elé vetítődik, így korrigálva a látási hibákat.\n-----\n94. • Mit mond ki a Fermat-elv? (Optika.)\nA Fermat-elv szerint a fény mindig a lehető legrövidebb úton halad. Ez a tükör- és lencsék működésének alapja.\n-----\n95. • Ki fogalmazott meg először elméletet a fénnyel kapcsolatban, mely a fény egyfajta hullámszerűterjedésére vonatkozott?\nChristian Huygens holland fizikus fogalmazott meg először hullámszerű elméletet a fény terjedésével kapcsolatban, amely szerint a fényhullámok transzverzális hullámok, és terjedésük sebessége függ a közeg anyagi tulajdonságaitól.\n-----\n96. • Az optika mely területén tett jelentős előrehaladást Newton?\nNewton jelentős előrelépést tett az optika területén azzal, hogy megalkotta a spektrumelméletet, melynek segítségével bebizonyította, hogy a fehér fény valójában színek keveréke. Emellett az optikai törvényeket is kidolgozta, melyek magyarázzák a fény általános viselkedését a különböző közegben. Newton munkássága kiemelkedő jelentőséggel bír az optika tudományának fejlődése szempontjából.\n-----\n97. • Ki és mikor méri meg először a fény sebességét?\nAz első fénymérési kísérletet Olaus Roemer végzett 1676-ban, amikor a Jupiter és annak holdjai mozgását figyelte. Az első pontosabb mérési eredményt az 1840-es években érte el Hippolyte Fizeau és Leon Foucault.\n-----\n98. • Mi volt az első sikeres fénysebesség-mérés ötlete?\nAz első sikeres fénysebesség-mérés ötlete az 1676-ban született Olaus Roemerhoz köthető. A dán csillagász azon észrevétele alapján jutott arra a következtetésre, hogy a Jupiter holdjainak látszólagos helyzete változik a Földről nézve, ami az időjárási viszonyoktól függetlenül következett be, így sikerült meghatározni a fénysebességet.\n-----\n99. • Kb. hány százaléknyira tért el a valódi értéktől az első sikeres fénysebesség-mérés eredménye?\nAz első sikeres fénysebesség-mérés eredménye csak körülbelüli értéket adott, amelynek eltérése a valódi értéktől nagyjából 0,3%-os volt. Ez azonban az idővel végzett pontosabb méréseknek köszönhetően tovább csökkent.\n-----\n100. • Körülbelül mikor vált 3 tizedesjegy pontossággal ismertté a fény terjedési sebessége?\nA fény terjedési sebességének 3 tizedesjegy pontossággal való ismertté válása a 20. század elején történt. A pontos mérésre azonban már korábban is volt lehetőség, például az Fizeau-Foucault kísérlettel már az 1850-es években is mérések készültek.\n-----\n101. • Mi motiválta Newtont a tükrös távcső felfedezésében?\nNewton a tükör távcső felfedezése során a korábban használt lencsés távcsövek által okozott torzításokat kívánta kiküszöbölni, és egy olyan eszközt akart tervezni, amely lehetővé teszi a tiszta és éles képek megfigyelését.\n-----\n102. • Ki és kb. mikor adta meg először a helyes magyarázatot a szivárvány keletkezésére?\nRobert Boyle és Isaac Newton már az 1600-as években elkezdték kutatni a szivárvány jelenségét, de a helyes magyarázatot Thomas Young adta meg 1801-ben, amely szerint a szivárvány a napfény szétválásának eredménye, amikor a fény megtörik és szétszóródik a vízcseppeken.\n-----\n103. • Newton optikai munkái során észrevett egy jelenséget, amit az utókor Newton-gyűrűknek nevez.Milyen eszköznél lépett fel ez a jelenség és körülbelül hogyan nézett ki?\nA jelenség egy új optikai eszköz, a Newton-gyűrűk használatakor jelentkezett. Ez egy olyan eszköz, amelynek segítségével a fénytörési indexet lehet mérni, és a jelenség abból adódott, hogy a két üveglap közötti levegőréteg vastagsága nem volt egyenletes.\n-----\n104. • Milyen alapvető hiba kiküszöbölésére tervezte és épı́tette meg Isaac Newton az első tükröstávcsövet? Sikerült elérnie célját?\nIsaac Newton az első távcsövét úgy tervezte, hogy a tükrök felületeit precízen megmunkálta, így minimalizálta a tükörhibákat, amelyek az előző lencsés távcsövekben gyakoriak voltak. Sikerült elérnie célját, és a tükörteleszkóp a mai napig fontos eszköze az asztrofizikának és az űrkutatásnak.\n-----\n105. • Nevezzen meg azt a jelenséget (felfedezővel és dátummal együtt), melynek lényege az, hogy acsillagok látszólagos iránya a Föld Nap körüli keringése és a fény véges terjedési sebessége miattmegváltozik!\nA jelenség neve: abberáció. Felfedezője: James Bradley. Dátuma: 1727. Az abberáció lényege, hogy az égitestek látszólagos helyzetének változása következik be a Föld évenkénti keringése és a fény véges terjedési sebessége miatt.\n-----\n106. • Milyen eszköz segı́tségével bontotta Isaac Newton szı́nekre a fehér fényt? Milyen eszköz meg-javı́tását szerette volna elérni a szı́ntani kutatásokkal?\nIsaac Newton egy prizmát használt a fehér fény színekre bontásához. A színtani kutatásokkal foglalkozva egy spektroszkópot fejlesztett ki, amely lehetővé tette a színképek részletes elemzését és összehasonlítását.\n-----\n107. • Ismertesse röviden azt a jelenséget, amit Newton fedezett fel és utalt a fény hullámtermészetére!(Megnevezés és rövid leı́rás is kell!)\nNewton a fehér fényt prizmán keresztül bontva észlelte, hogy a különböző színek eltérő szögben törnek meg. Ebből arra következtetett, hogy a fény nem csak részecskék, hanem hullámok formájában is terjed. Ezt nevezzük a fény hullámtermészetének.\n-----\n108. • Kik és kb. mikor továbbı́tottak először elektromos állapotot fém huzalon keresztül? Használhatóvolt módszerük gyors jeltovábbı́tásra?\nKik és KB 1831-ben továbbítottak először elektromos áramot fémhuzalon keresztül. Ez a módszer nem volt hatékony a gyors jeltovábbításra, mivel az áram gyorsan gyengült és torzult a huzalon.\n-----\n109. • Ismerték-e az ókori görögök az elektromosság valamilyen formáját? És a mágnesességet?\nAz ókori görögök ismerték az elektromosság valamilyen formáját, például a tapasztalati megfigyeléseik alapján a gyantából dörzsöléssel elektromosan feltöltött állatbőrök vonzását. A mágnesességet is ismerték, például a magnézium ásványt, amely vonzta a vasat.\n-----\n110. • Mikor és ki dokumentálta először egy mágneses gömb erővonal-térképét?\nAz első mágneses gömb erővonal-térképet a 16. században William Gilbert angol tudós készítette.\n-----\n111. • Miben jelölte meg William Gilbert a mágneses és elektromos kölcsönhatásből származó erők főkülönbségét? Helyes volt megállapı́tása?\nWilliam Gilbert megállapította, hogy a mágneses és elektromos kölcsönhatásból származó erők különböznek egymástól, mivel a mágneses erők csak mágneses anyagokat vonzanak, míg az elektromos erők az összes töltött testet vonzzák vagy taszítják. Az általánosan elfogadott vélemény szerint helyesen állapította meg ezt a különbséget.\n-----\n112. • Ki vetette fel először, hogy a szilárd anyag kis részei közt elektromos kölcsönhatás van és ezbiztosı́tja a szilárdságot?\nBenjamin Franklin vetette fel először, hogy a szilárd anyagok kis részei között elektromos kölcsönhatás van, és ez biztosítja a szilárdságot. Azt is felfedezte, hogy a szilárd testekben a töltések mozgása lehetővé teszi az elektromos áram áramlását. Franklin a villamosság és a villamos jelenségek kutatásának egyik alapvető alakja volt.\n-----\n113. • Mire használható a leideni palack? Mai szóhasználattal minek nevezzük az ilyen eszközt?\nA leideni palack elektromos töltések tárolására használható, és széles körben alkalmazzák a kondenzátorokban. Az ilyen eszközt kondenzátornak nevezzük.\n-----\n114. • Kit szokás az első amerikai természettudósnak nevezni?\nKit Carson az első amerikai természettudósnak nevezhető, mivel a 19. században gyűjtötte és tanulmányozta az amerikai vadon élő állatokat és növényeket. Életében több expedíciót vezetett a nyugati térségekbe, és a természeti kincsek védelméért is küzdött.\n-----\n115. • Kitől származik a mai villámhárı́tók gondolata és első példányai?\nAz első villámhárító koncepciója Benjamin Franklinhoz köthető, aki 1752-ben egy drótból és egy pohár vízből álló szerkezetet épített fel, hogy vonzza a villámokat. Az első modern villámhárítót azonban Thomas-Francois Dalibard francia fizikus készítette el 1753-ban, amely egy magasabb torony tetején állt, és egy földelő dróttal volt kapcsolatban.\n-----\n116. • Mi volt a szerepe a torziós ingának az elektrosztatika alaptörvényeinek felfedezésében?\nA torziós inga segített meghatározni a Coulomb-törvény alapvető paramétereit, például az elektromos töltések közötti vonzó vagy taszító erőt a távolság függvényében. Ez lehetővé tette az elektrosztatika alapelveinek kidolgozását.\n-----\n117. • Ki határozta meg mérések alapján a pontszerű töltött testek közt fellépő erő nagyságát megadóformulát?\nCoulomb határozta meg a pontszerű töltött testek között fellépő erő nagyságát mérések alapján. A Coulomb-törvény szerint az erő nagysága a töltések nagyságával arányos, és a töltések közötti távolság négyzetével fordítottan arányos.\n-----\n118. • Miért volt fontos az elektrosztatika alaptörvényeinek megismerésében az a megfigyelés, hogyegyenletesen töltött gömb belsejében nincs elektromos tér?\nAz elektrosztatika alapelvei segítenek megérteni az elektromos tér jelenségét. A megfigyelés, hogy az egyenletesen töltött gömb belsejében nincs elektromos tér, segít megérteni a töltött testek viselkedését és az elektromos tér jellemzőit. Ez az alapelv alapvető fontosságú az elektrosztatikai jelenségek megértésében és alkalmazásában.\n-----\n119. • Milyen fizikai szempontból volt jobb a Volta-féle áramforrás a dörzselektromos gépnél? Milyenszempontból volt rosszabb?\nA Volta-féle áramforrás jobb volt a dörzselektromos gépnél, mert stabilabb feszültséget és áramot biztosított. Azonban rosszabb volt, mert kisebb teljesítményt produkált és nehezebb volt előállítani.\n-----\n120. • Mikor és ki fedezte fel az áram mágneses terét?\nAlessandro Volta fedezte fel az áram mágneses terét 1820-ban, amikor észrevette, hogy egy vezető drótot árammal átfúrva egy mágnes közelében kitér a helyzetéből. Ezzel elindult a mágneses mezők tudományos vizsgálata.\n-----\n121. • Oersted téves kapcsolatot feltételezett az áram és a mágneses tér között? Mi volt tévedésénekalapja?\nOersted nem vette figyelembe, hogy az áram és a mágneses tér között összefüggésít nem kapcsolják bétartományok, és hogy az áram és a mágneses tér között összefüggésít csak akkor lehet megvalósítani, ha áram a magnéziumot átfolytatja.\n-----\n122. • Ki és mikor fedezte fel az áramjárta vezetékek egymásra gyakorolt erőhatását?\nAlessandro Volta fedezte fel az áramjárta vezetékek egymásra gyakorolt erőhatását 1800-ban, amikor két fémlemezt egymás mellé helyezett, és közéjük nedves anyagot rakott. Ezután rájött, hogy az egymást érő két fémlemez között áram folyik, amely a nedves anyagon keresztül halad.\n-----\n123. • Mit fedezett fel kı́sérletileg Faraday a fény és a mágneses tér kapcsolatáról?\nFaraday fedezte fel, hogy a változó mágneses tér által keltett elektromos áram változó elektromos tér hatására fényt bocsát ki. Ez a folyamat az elektromágneses indukció alapja.\n-----\n124. • Kit tartott James Clerk Maxwell az ő egyenleteinek ötletadójának?\nJames Clerk Maxwell az elektromágnesesség matematikai leírásával kapcsolatos ötletadó volt, és kidolgozta az elektromágneses hullámok elméletét, amelynek alapja az ő által megalkotott Maxwell-egyenletek rendszere. A munkássága alapján tekinthető az elektromágnesesség modern tudományának atyjának.\n-----\n125. • Ki és mikor igazolta először kı́sérletileg az elektromágneses hullámok létezését?\nHeinrich Hertz német fizikus igazolta először kísérletileg az elektromágneses hullámok létezését 1887-ben. Hertz két elektródát helyezett el egy távolságra egymástól és elektromos áramot vezetett át rajtuk, majd megfigyelte, hogy a két elektróda között elektromos hullámok jelennek meg.\n-----\n126. • Az 1800-as évek vége felé a fizikusok azt képzelték, hogy az elektromágneses hullámok egy éter”-nek nevezett közegben terjednek. Milyen kı́sérletet végeztek a Földnek az éterhez viszonı́tottmozgásának kimutatására? Mi volt a kı́sérlet eredménye?\nMichelson-Morley kísérletet végeztek, amelyben két merőleges irányban mértek a Föld mozgásához viszonyítva. Az eredmény az volt, hogy nem sikerült kimutatni az éter létezését, ami alapvetően megváltoztatta a fizikusok elképzelését az elektromágneses hullámok terjedéséről.\n-----\n127. • Melyik volt az első elektromosságtani berendezés, melynek súlyos élettani hatásai lehettek?\nAz első elektromosságtani berendezés, amelynek súlyos élettani hatásai lehettek, az elektromos szék volt. Ez egy olyan eszköz volt, amely elektromos árammal átjárta az ülőfelületet, és az arra ülő személyt erős fájdalommal és bizsergéssel sújtotta.\n-----\n128. • James Clerk Maxwell elméleti úton kimutatta az elektromágneses hullámok létét. Mi volt azkonkrét, számszerűsı́thető érv, melyet felhasznált arra, hogy ezeket azonosı́tsa a fénnyel?\nMaxwell egyenletei azt mutatták, hogy az elektromágneses hullámok sebessége megegyezik a vakuum fénysebességével. Ez alapján következtetett arra, hogy a fény is elektromágneses hullámok formájában terjed.\n-----\n129. • Melyik jelenség volt az, melynek felfedezése lehetővé tette a pontos áramerősség-mérést? Ki ésmikor tette ezt a felfedezést?\nA jelenség, amelynek felfedezése lehetővé tette a pontos áramerősség-mérést, az elektromos ellenállas volt. Georg Simon Ohm nevező felfedezése 1827-ben történt.\n-----\n130. • James Clerk Maxwell tisztán elméleti úton, a korábban felfedezett összefüggések összhangra hozásaközben fedezett fel egy fizikai hatást. Mi ennek a lényege?\nJames Clerk Maxwell az elektromágneses hullámok elméletének kidolgozása során felfedezte, hogy a változó elektromos mezők és mágneses mezők egymástól függetlenül nem létezhetnek, hanem mindig egymást keltik. Ez a felfedezés az elektromágneses indukció alapjául szolgál.\n-----\n131. • Gray és társa az 1700-as években fém huzalon elektromos jelet tudott továbbı́tani. Emlı́tsen megkét olyan problémát, melyek miatt ebből akkor még nem tudott vezetékes távközlés kialakulni!\nAz elektromos jelek gyengék voltak és nagy távolságokon nem tudtak hatékonyan továbbítódni. Az elektromos huzalok pedig drágák és nehézkesek voltak, így nem voltak elterjedtek.\n-----\n132. • A kerékpár dinamója változó mágneses tér segı́tségével állı́t elő feszültséget. Ki és mikor fedeztefel az ennek alapjául szolgáló fizikai jelenséget? Hogyan nevezzük ezt a hatást?\nMichael Faraday fedezte fel az elektromágneses indukciót 1831-ben. Az elektromágneses indukció az az elektromos jelenség, amely során egy mozgó mágneses tér által keltett elektromos áramot hozunk létre egy vezetőben.\n-----\n133. • Heinrich Herz 1886-ban kı́sérletileg igazolta a Maxwell által elméletileg megjósolt elekt-romágneses hullámok létezését. Mai szóhasználattal milyen hullámoknak neveznénk a Herz általelőállı́tottakat?\nA Herz által előállított hullámokat elektromágneses hullámoknak vagy rádióhullámoknak nevezzük. Ezek a hullámok kiterjednek a rádiófrekvenciás tartományra és a legtöbb rádió- és televízióadás ezen a tartományon keresztül történik.\n-----\n134. • Az elektromos indukció elvét Michael Faraday fedezte fel, mégis azt mondjuk, hogy Jedlik Ányosaz öngerjesztéses dinamó feltalálója. Miért?\nJedlik Ányos kidolgozta az öngerjesztéses dinamó működési elveit, és megalkotta az első ilyen eszközt. Bár Faraday fedezte fel az elektromos indukció elvét, de a dinamó feltalálásához szükséges technológiai innovációkat Jedlik hozta létre. Ezért nevezzük őt az öngerjesztéses dinamó feltalálójának.\n-----\n135. • Ismertesse a Volta-oszlop szerkezetének lényegét! Milyen nagyságrendű feszültség volt ezzelelőállı́tható a gyakorlatban?\nA Volta-oszlop két fémlemez közötti kémiai reakciókra épülő elektromos generátor, amely állandó elektromos feszültséget biztosít. A feszültség nagysága pár volt, így alacsony teljesítményű készülékekhez volt használható.\n-----\n136. • Rajzolja fel egy leideni palack keresztmetszetének vázlatát! Egy-egy szóval ı́rja oda, melyik részmilyen fajta anyagból készült! Jelölje be azt a két pontot is, melyek közt a nagy feszültség jelentke-zett!\nA leideni palack keresztmetszete függőleges henger alakú. A falak üvegből készültek, a teteje és az alja pedig fémlemez. A nagy feszültség a palack közepénél jelentkezik, ahol a legnagyobb a nyomás.\n-----\n137. • Benjamin Franklin fizikai kutatásai mellett pl. tűzoltóság szervezéssel is foglalkozott. Elektro-mosságtani kutatásaiból egy olyan fontos felfedezés is született, ami a tűzoltók munkáját is csökken-tette. Mi volt ez?\nBenjamin Franklin felfedezte, hogy az elektromos áram és a villám ugyanolyan jelenségek, és az elektromos áramot lehet használni villámhárítók és tűzoltó készülékek kifejlesztésére. Ez a felfedezése segített csökkenteni a tűzoltók munkáját és növelte a tűzvédelmi biztonságot.\n-----\n138. • Mondjon egy okot, amiért Jedlik Ányos első villanymotorja (villanydelejes forgony) nem volt al-kalmas ipari felhasználásra!\nAz első villanymotor nem volt alkalmas ipari felhasználásra, mert kis teljesítményű volt és nehézkesen lehetett vezérelni. Továbbá, a korai elektromos technológia még nem volt elég fejlett ahhoz, hogy megbízhatóan működjön nagyobb terhelések alatt.\n-----\n139. • Mire alkalmazta Jedlik Ányos az általa fejleszett villanymotorokat? (2 alkalmazás)\nJedlik Ányos az általa kifejlesztett villanymotorokat elsősorban kísérleti célokra használta, azaz a működésük és az általuk előállított erő megfigyelésére. Emellett a villanymotorokat kis modellhajók mozgatására is használta.\n-----\n140. • Mondjon 3 témát, melyre a 19. század végi fizikai ismeretek alapján adott válaszok nem egyezteka megfigyelési eredményekkel.\n1. Az ultraviola sugárzás hatása a bőrre: Az 19. századi fizikai ismeretek alapján úgy gondolták, hogy az UV-sugárzás csak enyhén károsítja a bőrt, azonban későbbi megfigyelések bizonyították, hogy az erős UV-sugárzás súlyos bőrkárosodást okozhat.\n\n2. Az árnyékok: Az 19. században általánosan elfogadott volt, hogy az árnyékok abszolút feketeek, azonban a megfigyelések azt mutatták, hogy az árnyék színe függ a környező fényforrásoktól és a tárgy anyagától.\n\n3. Az elektronok viselkedése az atomokban: Az 19. században úgy gondolták, hogy az atomokban az elektronok körpályákat követnek, mint ahogy a bolygók keringenek a Nap körül. Azonban későbbi megfigyelések bizonyították, hogy az elektronok valójában valószínűségi hullámok, amelyek valószínűségi felhőként mozognak az atomokban.\n-----\n141. • Mi volt Mach elképzelése az inerciarendszerekkel kapcsolatban? Mai tudásunk alapján igaznakmondhatjuk ezt?\nMach elképzelése az volt, hogy csak azok az inerciarendszerek léteznek, amelyek relativitáselméleti szempontból egymáshoz viszonyítva is nyugvó állapotban vannak. Mai tudásunk alapján ez nem igaz, hiszen az inerciarendszerek relativitáselméleti szempontból egymáshoz viszonyítva is mozgásban lehetnek.\n-----\n142. • Ernest Mach természetfilozófiai gondolatai mely későbbi fizikai elméletnek szolgáltattak közvet-lenül elvi alapokat?\nErnst Mach természetfilozófiai gondolatai közvetlenül szolgáltattak elvi alapokat az általános relativitáselméletnek, különösen az inerciarendszerrel kapcsolatos fogalmak és a gyorsulási erő fogalmának megértésében. Mach az inerciarendszerek relativitáselméletbeli magyarázatai a gravitáció által kiváltott gyorsulási erőre utaltak.\n-----\n143. • Ki volt az, aki először ismertetett részletesen, axiomatikusan felépı́tve egy Euklideszétől eltérőgeometriai rendszert?\nAz orosz matematikus Nikolai Lobachevsky volt az első, aki egy axiomatikus non-euklideszi geometriai rendszert dolgozott ki, amelyben az összefüggő egyenesek párhuzamosak lehetnek. Ezt az elméletet a 19. század elején dolgozta ki, és nagy hatással volt a matematika és a fizika fejlődésére.\n-----\n144. • Írja le 3 olyan, 19. századi matematikus nevét, akiknek geometriai munkássága az általános relati-vitáselmélethez alapvető fontosságú volt.\n1. Bernhard Riemann (1826-1866): Riemann geometriája lehetővé tette az általános relativitáselmélet legfontosabb matematikai alapjának, a görbületi tenzoroknak az előállítását.\n2. Henri Poincaré (1854-1912): Poincaré geometriai munkája nagymértékben hozzájárult a tér és idő relativitásának elméletéhez, és fontos szerepe volt az ezzel kapcsolatos koncepciók kidolgozásában.\n3. David Hilbert (1862-1943): Az általános relativitáselmélet matematikai alapjainak kidolgozása során Hilbert nagy szerepet játszott, és munkássága segített a relativitáselmélet matematikai szintre emelésében.\n-----\n145. • Mi Eötvös Lóránd szerepe az általnos relativitáselmélet kialakulásában?\nEötvös Lóránd magyar fizikus munkája fontos szerepet jàtszott az általnos relativitáselmélet kialakulásában, különösen az inga-kísérleteivel, amelyekkel a gravitációs hatást vizsgálta. Az eredmények hozzájárultak az általános relativitáselmélet kidolgozásához.\n-----\n146. • Adjon meg legalább két olyan mérést, megfigyelést, mely az 1905-ös évben más ismert volt és arelativitáselmélet alapjául szolgált!\n1. A Michelson-Morley kísérletben a Föld mozgásának hatását vizsgálták a fény sebességére, de a mérés eredménye nem mutatott különbséget a Föld mozgása és annak hiánya között.\n2. A Perihélium precessziója, vagyis a Merkúr pályájának előrehaladása az elvártnál nagyobb mértékben történt, ami a relativitáselméletben helyes magyarázattal lett ellátva.\n-----\n147. • Ki(k) dolgozta(-ák) ki a speciális relativitáselmélet matematikai alapjait?\nAlbert Einstein dolgozta ki a speciális relativitáselmélet matematikai alapjait 1905-ben. Az elmélet szerint az idő és a tér relatív fogalmak, és a fénysebesség minden megfigyelő számára állandó marad.\n-----\n148. • Kinél, mikor és milyen rendszerekre vonatkozóan bukkan fel először a hı́res E = mc2 formula?\nEinstein 1905-ben dolgozta ki az E = mc2 képletet, amely az anyag és energia ekvivalenciáját írja le. Ez az elmélet azonban csak 1915-ben kapott széles körű elismerést a relativitáselmélet megjelenésével.\n-----\n149. • Ki adja meg először teljes általánosságban a speciális relativitáselmélet dinamikai alapegyenleteit?\nA speciális relativitáselmélet dinamikai alapegyenleteit először Albert Einstein publikálta 1905-ben az \"Elektrodinamikai jelenségek Lorentz-transzformációi\" című munkájában. Az egyenletek a relativisztikus mozgásegyenlet és az energia-impulzus megmaradás törvényének matematikai kifejezései.\n-----\n150. • Bolyai János nemeuklideszi geometriája mely fizikai elmélet matematikai alapjainak részét képezi?\nBolyai János nem-euklideszi geometriája a modern fizikai elméletek, például az általános relativitáselmélet matematikai alapját képezi. A nem-euklideszi geometria lehetővé teszi a tér görbületének leírását, amely fontos szerepet játszik a gravitáció és a világegyetem viselkedésének megértésében.\n-----\n151. • Ki vetette fel először, hogy a fizikai tér görbültségének geometriáját az anyag eloszlása határozzameg?\nAlbert Einstein vetette fel először a fizikai tér görbületének geometriáját az anyag eloszlása határozza meg, amit a relativitáselméletében írt le. Einstein elképzelése szerint a két tényező között szoros kapcsolat van, és az anyag hatása befolyásolja a tér görbületét.\n-----\n152. • Ki és mikor adja meg először az anyag eloszlásának és a téridő geometriájánák kapcsolatát leı́róegyenletet?\nAz anyag eloszlásának és a téridő geometriájának kapcsolatát leíró egyenletet először Einstein adta meg 1915-ben az általános relativitáselméletében, amely leírja a gravitációt az idő és a tér összefonódásaként. Az egyenlet a gravitációs erőt a tér-idő görbületének függvényében írja le, amelyet az anyag és az energia jelenléte okoz.\n-----\n153. • Mi volt az általános relativitáselmélet első megfigyelési bizonyı́téka?\nAz általános relativitáselmélet első megfigyelési bizonyítéka az volt, hogy a Nap tömegének gravitációs hatása elhajlítja a közelében elhaladó fény útját, ami az 1919-es napfogyatkozás során lett megfigyelve. Ez megerősítette Einstein elméletét, amely szerint a tömeg idézi elő a tér görbületét.\n-----\n154. • Mai tudásunk szerint mi a fizikai oka a súlyos és tehetetlen tömeg pontos arányosságának?\nA fizikai oka a súlyos és tehetetlen tömeg pontos arányosságának az anyagok molekuláris szerkezete és azok kölcsönhatásai, valamint a gravitációs vonzás erőssége. Ez határozza meg az anyag tömegét és azon keresztül a súlyát.\n-----\n155. • Milyen szerepük volt a torziós ingáknak az általános relativitáselmélet kialakulásában?\nA torziós ingák segítették Einstein-t abban, hogy megértsék a tér-idő görbületének mechanizmusát. Az általuk előidézett forgás segítette az általános relativitáselmélet matematikai leírásának kidolgozását.\n-----\n156. • Melyik elmélet kı́sérleti bizonyı́téka volt annak kimutatása, hogy a csillagok fénye elhajlik a Napmellett?\nAz általános relativitáselmélet kísérleti bizonyítéka volt annak kimutatása, hogy a csillagok fénye elhajlik a Nap mellett. Az 1919-es napfogyatkozás során megfigyelték, hogy a Nap közelében elhaladó csillagok fénye valóban elhajlik, ahogy azt Einstein előre megjósolta.\n-----\n157. • Nevezzen meg legalább két olyan mérést, megfigyelést, mely az 1905-ös évben más ismert volt ésa speciális relativitáselmélet alapjául szolgált! Egy-egy mondatban adja meg a lényegüket is.\n1. Michelson-Morley kísérlet: Ez a kísérlet azt mutatta, hogy az éter nem létezik. Michelson és Morley azt várták, hogy az éterrel való interakció hatására a fény hullámai némi eltérést mutatnak majd, de semmi ilyesmi nem történt.\n\n2. FitzGerald-Lorentz összefüggés: Ez az összefüggés azt állítja, hogy a testek hossza megrövidülnek, amikor nagy sebességgel mozognak. Ez magyarázza, hogy miért nem észleljük az anyag mozgását a Michelson-Morley kísérlet során.\n-----\n158. • Kinek a nevéhez fűződik a kvantummechanika hullámtani felfogásának alapegyenlete?\nA kvantummechanika hullámtani felfogásának alapegyenlete Erwin Schrödinger nevéhez fűződik. Az egyenlet megmutatja a csökéndés időbeli fejlődését egy kvantummechánikai rendszerben, ezzel lehetővé téve a rendszer többi tulajdonságának kiszamitását.\n-----\n159. • Mi volt az a fizikai jelenség, melynek számszerű lefolyását Max Planck csak azzal a felételezésseltudta megmagyarázni, hogy a fény kis adagokban távolzik az anyagból?\nA fotoelektromos hatás volt az a fizikai jelenség, melynek számszerű lefolyását Max Planck csak azzal a feltételezéssel tudta megmagyarázni, hogy a fény kis adagokban távozik az anyagból, azaz a fény kvantumokból áll. Ez az alapja a kvantummechanikának.\n-----\n160. • Mi volt az a jelenség, melyet Albert Einstein magyarázott meg és a kvantummechanika ki-fejlődésében alapvető fontosságú lett?\nAz általános relativitáselméletével együttműködő kvantummechanikával kapcsolatos problémákat vizsgálva Einstein megalkotta a „spukhafte Fernwirkung” hipotézisét, azaz a távoli hatás elvét, amely meghatározó szerepet játszott a kvantummechanika fejlődésében és az ún. EPR-paradoxonban.\n-----\n161. • Mi az alapvető szemléleti különbség a kvantummechanika és a klasszikus mechanika között ajövőbeli események előre kiszámı́tásával kapcsolatban?\nA klasszikus mechanika a jövőbeli események előre kiszámítását determinisztikus módon végzi, míg a kvantummechanika esetében csak valószínűségi előrejelzéseket lehet tenni a rendszer állapotára vonatkozóan. Ezen kívül a kvantummechanika esetében a mérések befolyásolják a rendszer állapotát, míg a klasszikus mechanikában nem.\n-----\n162. • Mi volt a fő oka, hogy a kutatók nem fogadták el egyből de Broglie felvetését, miszerint az elekt-ronnak is lenne hullámtulajdonsága?\nA kutatók a klasszikus fizika alapján úgy gondolták, hogy az anyagi részecskéknek csak részecske jellegük van, és nem rendelkeznek hullámtulajdonsággal. De Broglie felvetése a kvantummechanika születéséhez vezetett, amelyben az anyagi részecskéket hullámként és részecsként is leírják.\n-----\n163. • Mit állı́tott Planck a feketetest-sugárzásról, amikor levezette annak hullámhossz-szerinti el-oszlásának törvényeit?\nPlanck a feketetest-sugárzást kvantummechanikai megközelítéssel írta le, azaz a sugárzás energiaátadása diszkrét \"csomagokban\" (kvantumokban) történik. Ennek eredményeként a sugárzás spektruma hullámhossz-függően nem folytonos, hanem szakaszos eloszlást mutat, ami a Planck-függvény alakjában jelenik meg.\n-----\n164. • Miért egy üregből kijövő sugárzást tanulmányoztak a fizikusok, amikor a feketetest-sugárzástvizsgálták?\nAz üregből kijövő sugárzás a feketetest-sugárzás mérésének fontos része. A fizikusok azt vizsgálták, hogy milyen spektrumú és intenzitású a sugárzás, amely az üregből kijön, hogy megértsék a feketetest-sugárzás jelenségét.\n-----\n165. • Mivel magyarázta Einstein azt, hogy a fényelektromos hatás során egy bizonyos hullámhossz felettnem lép ki elektron a besugárzott fémből?\nEinstein az anyagban lévő elektronokhoz hasonlóan fotonoknak is van energiaküszöbük, amelyet átlépve az adott foton képes kiszakítani egy elektront a fém atomjából. Ez az energiaküszöb a foton frekvenciájától függ, és a felettük lévő fotonok képesek kiszakítani az elektront.\n-----\n166. • Hogy hı́vják azt az egyenletet, ami megadja a kvantummechanikai hullámfüggvény változásánakmódját?\nEzt az egyenletet Schrödinger egyenletnek nevezik, és a kvantummechanika alapját képezi. Az egyenlet megadja a rendszer állapotának időbeli fejlődését, és a hőmérsékletre, nyomásra, sűrűségre és más nehezen mérhető fizikai jellemzőkre adott válaszokat.\n-----\n167. • A Bunsen és Kirchhoff által a 19.szd-ban felfedezett szı́nképelemzést hamar felhasználták pl. akémiai elemzésekben. Mi tette ezt lehetőv?\nA színkepelemzés lehetővé tette az anyagok spektrumának részletes vizsgálatát, amely segített az elemek azonosításában és az anyagok összetételének meghatározásában. Ez a módszer nagyban hozzájárult az analitikai kémiai kutatások fejlődéséhez.\n-----\n168. • Miért látszott azonnal, hogy a planetáris atommodell, mely szerint az elektronok kis ponttöltéskéntkeringenek a mag körül a klasszikus fizika szabályai szerint, nem lehet igaz? (Két dolgot is emlı́tsenmeg, ami ellentétes a megfigyelésekkel.)\nAzonnal látszott, hogy a planetáris atommodell nem lehet igaz, mert ellentmondott az elektronok spektrumokban tapasztalt diszkrét energiaszintjeivel és az anyagok kémiai tulajdonságaival. Az elektronok keringése a mag körül nem lehet folyamatos, mert az ellentmondana a fényspektrumokban tapasztalt vonalaknak.\n-----\n169. • Mi a Schrödinger-egyenlet és a newtoni mechanika kapcsolata?\nA Schrödinger-egyenlet a kvantummechanika alapja, mely leírja a részecskék hullámfüggvényét és valószínűségi eloszlását. A newtoni mechanika a klasszikus fizika része, mely a makroszkopikus testek mozgását írja le. A két elmélet között nincs közvetlen kapcsolat.\n-----\n170. • Ki és mikor dolgoztt ki elmletet, mely a kvantummechanika és az általános relativitáselmélet mind-egyikét teljesen magába foglalja?\nAlbert Einstein dolgozta ki az általános relativitáselméletet, mely az idő és tér különleges kapcsolatát írja le. Azonban a kvantummechanikával ellentétben nem foglalja magába a részecskék viselkedését és az elektromágneses erőket.\n-----\n171. • Mit hittek, mi van az atommagban a protonon kı́vül, mielőtt felfedezték a neutront?\nAz atommagban a protonokon kívül más részecskék is vannak, de ezek létezését csak a neutron felfedezése után sikerült igazolni. A neutronok a protonokkal együtt alkotják az atommagot.\n-----\n172. • Mi a tömegdefektus jelensége az atommagok esetében?\nA tömegdefektus jelensége az atommagok esetében az, hogy a mag tömege kisebb, mint az összes alkotóeleme (protonok és neutronok) tömege. Ez az eltérés az anyagból felszabaduló energia formájában jelenik meg.\n-----\n173. • Ki és milyen anyaggal kapcsolatban fedezte fel a radioaktivitás jelenségét?\nHenri Becquerel 1896-ban fedezte fel a radioaktivitást, amikor uránium-vegyületeket helyezett egy fényérzékeny lemezen, majd azokat egy zacskóba rejtette. Később a lemezre vetett sugárzás maradandó nyomokat hagyott, amelyeket Becquerel a radioaktivitás eredményeként értékelhetett.\n-----\n174. • Ki az a magyar fizikus, aki a hidrogénbomba megalkotásában kulcsszerepet vitt?\nA magyar fizikus, aki kulcsszerepet játszott a hidrogénbomba megalkotásában, Teller Ede volt. Teller az amerikai Manhattan-projekt egyik vezetője volt, és a hidrogénbomba koncepciójának kidolgozásában és tesztelésében is részt vett.\n-----\n175. • Melyik új elemeket fedezte fel a Curie-házaspár az urán tartalmú ércek sugárzásának kutatásaközben?\nA Curie-házaspár az urán tartalmú ércek sugárzásakor felfedezte a rádiumot és a polóniumot, valamint az elemek radioaktivitásának jelenségét. Ezek az új elemek alapvető fontosságúak voltak a radioaktivitás és az atomfizika kutatásában.\n-----\n176. • Miből következtettek először a neutrı́nók létére?\nA neutrínók létezését először 1930-ban Pauli svájci fizikus javasolta, hogy megmagyarázza az elektronok által a radioaktív bomlás során kibocsátott energia megmaradását. Az első neutrínók észlelésére azonban csak 1956-ban került sor, amikor Reines és Cowan amerikai fizikusok a nukleáris reaktorokban keletkező antineutrínók észlelésével bizonyították azok létezését.\n-----\nNormál kérdések!\n-----\n0. • Ismertesse röviden, milyen problémát vélt felfedezni Zénon abban, hogy Achilleusz utoléri ateknősbékát! Mai szavakkal hogyan oldaná fel ezt a problémát?\nZénón arra a problémára hívta fel a figyelmet, hogy ha Achilleusz egy lassabb mozgású tárgyat üldöz, például egy teknősbékát, akkor sosem érheti utol, mert mindig csak a távolság felére fogja csökkenteni az eltávolodásukat. Azaz előbb meg kellene érnie az eltávolodás felének az utolsó részét, majd a fennmaradó felének az utolsó részét, és így tovább, végtelen számú részre osztva az eltávolodást. Mai szavakkal a probléma megoldása az, hogy a matematikai fogalmakat használva meg kell értenünk, hogy az idő és a távolság folyamatosan változik, és hogy az elméleti problémák nem feltétlenül tükrözik a valós világot.\n-----\n1. • Milyen csoportokra oszotta az arisztotelészi mechanika a mozgásokat? Mindegyikre mondon egy-egy konkrét példát is.\nAristoteles mechanikája szerint a mozgásokat három csoportba lehet osztani: természetes mozgások, erőltetett mozgások és az állapotváltozások.\n\nA természetes mozgások olyan mozgások, amelyek a test természetéből fakadnak, és nem igényelnek semmilyen külső hatást. Például az égitestek mozgása az égen, a természetes elemek mozgása (víz, tűz, levegő), valamint a szervezetek saját mozgása (pl. az emberi test önsúlya hatására lefelé mozog).\n\nAz erőltetett mozgások olyan mozgások, amelyeket külső erő hatására hajtanak végre. Például egy test húzása vagy tolása, illetve egy test felgyorsítása vagy lelassítása.\n\nAz állapotváltozások olyan mozgások, amelyekben a test állapota megváltozik, de helyzete nem változik. Például a test hőmérsékletének emelkedése vagy csökkenése, az anyag halmazállapotának változása (pl. víz forrása vagy fagyása).\n\nEzek a mozgások az arisztotelészi mechanika alapjai, és azóta is hasznosítják őket a fizika és a természettudományok területén.\n-----\n2. • Foglalja össze Arkhimédesz főbb eredményeit a matematikában és a fizikában! (Legalább 2 mate-matikai és 2 fizikai eredmény.)\nArkhimédesz az egyik legnevesebb matematikus és fizikus az anti-kór szigetrol. Eredményei közül az egyik legfontosabb a koronak problémája megoldása, amelynek során az objektum terfogatának meghatározására létrehozott mérlék segítségével meghatározta az objektum sűrűségét. Emellett Arkhimédesz kifejezte a havazas, a robbanások, a hajók mozgásának kérdéseit is matematikai formulákban, és a fizikában a leghiresebb eredményei közül a folyadékok vizsgálata, a kupola felszínének meghatározása, valamint az említett koronak problémája a legemlékezetesebb. Ezek az eredmények ma is alapvető fontossággal bírnak a matematikában és a fizikában.\n-----\n3. • Hogyan alakult ki a mai tı́zes számrendszerű, helyiértékes számı́rás? Ismertesse vázlatosan afőbb állomásokat hely, körülbelüli időpont és a hozzátett eredmények alapján a kezdetektől a maitizedestörtek kialakulásáig.\nA helyiértékes számítás kialakulása több ezer évre nyúlik vissza, azonban a modern tizedes számrendszer csak a 17. században jelent meg. Az ókorban a rómaiak használtak helyiértékes számrendszert, amelyben azonban nem volt nulla számjegy. A középkorban az arabok által fejlesztett helyiértékes számrendszer már tartalmazta a nullát, amely nagyban megkönnyítette a számolást. Az indiai matematikusok által kifejlesztett helyiértékes számrendszer azonban a 9. században már használatban volt. A modern tizedes számrendszer kialakulása a 17. században kezdődött, amikor az olasz matematikus, Simon Stevin javasolta a tízes alapú számrendszert. A mai tizedes számrendszer azonban csak a 19. században vált általánossá.\n-----\n4. • Milyen alakúnak és milyen középpontúnak gondolta a bolygók pályáját Ptolemaiosz, Kopernikusz,Tycho Brahe, Kepler, Galilei és Newton?\nPtolemaiosz úgy gondolta, hogy a bolygók pályája kör alakú és a Föld középpontjában helyezkednek el. Kopernikusz azt vélte, hogy a bolygók pályája kör alakú és a Nap középpontjában találhatók. Tycho Brahe úgy tartotta, hogy a bolygók pályája egyébként kör alakú, de a Föld középpontjában van a Nap körüli mozgásuk központja. Kepler szerint a bolygók pályája ellipszis alakú, és a Nap a középpontjukban helyezkedik el. Galilei és Newton is elfogadták a Nap középpontú modellt, Newton pedig a gravitációs erőtörvényével magyarázta a bolygók mozgását.\n-----\n5. • Ismertesse vázlatosan Euklidész Elemek c. munkájának logikai felépı́tésének jellegét! Mi az előnyeannak, hogy Euklidész ilyen módon tárgyalta a geometriát?\nEuklidész Elemek című munkája a geometria rendszeres és logikus felépítésére összpontosít. A munka 13 könyvből áll, melyek mindegyike egy bizonyos geometriai témát tárgyal. Euklidész geometriai bizonyításai rendkívül logikusak és átláthatóak, és gyakran használja a szintén általa kidolgozott axiómákat.\n\nAz előnye annak, hogy Euklidész ilyen módon tárgyalta a geometriát, az, hogy a könyvek rendkívül könnyen érthetőek és átláthatóak. Az axiómák használata lehetővé teszi a geometriai bizonyítások egyszerű és logikus felépítését. A munka rendszere lehetővé teszi a geometria széles körű tanulását és alkalmazását, és azóta is egy alapvető forrása a matematikának és a tudománynak.\n-----\n6. • A magukra hagyott testek mozgásáról a fizika története alatt többféle elképzelés született.(Megállnak, körpályán mozognak, egyenes vonalú egyenletes mozgást végeznek, stb.) Ismertesse,mit gondoltak a kérdésről az ókori görögök és milyen lépéseken keresztül született meg végül New-ton I. törvénye! (A görögökön és Newtonon kı́vül 3 köztes állomás Newton előtt, névvel, közelı́tőidőponttal és 1-1 mondatos összefoglalóval.)\nAz ókori görögök úgy gondolták, hogy a testeknek van egy természetes nyugalmi állapota, és csak akkor mozognak, ha valamilyen külső erő hat rájuk. Ezt az elképzelést Aristoteles fogalmazta meg. A középkorban Galilei megállapította, hogy a testeknek nincs természetes nyugalmi állapota, hanem csak akkor maradnak nyugton, ha nincs rájuk ható erő. Ezt követően Newton állapította meg az első törvényt, amely szerint a testek egyenes vonalú egyenletes mozgást végeznek mindaddig, amíg külső erő nem hat rájuk. Newton ezzel a törvénnyel forradalmi változást hozott a fizikai gondolkodásban, és lehetővé tette a modern fizika fejlődését.\n-----\n7. • Ismertesse a peripatetikus dinamika alapgondolatait, a mozgások csoportosı́tását és a dinamikaialaptörvényét.\nA peripatetikus dinamika az álló és mozgó testek mozgását tanulmányozza, azok alapvető mozgási törvényeit és egymásra hatásait. A mozgásokat három csoportra osztja: egyenes, körmozgásokra és le- és felmozgásokra. Az alapvető mozgási törvények közé tartozik a dinamikai alapvető törvénye, mely szerint a testekre ható erővel arányosan nő a test mozgási sebessége, illetve ha az erő eltűnik, a test mozgása is megszűnik. Ezt a törvényt nevezik Newton második törvényének is. A dinamikai alaptörvény azt is megmondja, hogy egy test hogyan viselkedik, ha több erő hat rá, vagy ha az erő iránya változik. Az alapvető törvények segítségével a peripatetikus dinamika képes elemi mozgásokat leírni és a bonyolultabb mozgásokat összerakni.\n-----\n8. • Rajzolja fel vázlatosan a Föld, Hold, Nap és a Mars pályáját Ptolemaiosz, Kopernikusz, Tycho deBrahe és Kepler szerint! Az ábrák alá legyen odaı́rva, melyik csillagász rendszeréről van szó, azábárákon egyértelműen látsszon, melyik égitest melyik, és a pályák mellé ı́rja oda a pálya alakjánakgeometriai nevét (Pl.: kör, spirál, ellipszis, parabola).\nPtolemaiosz szerint a Föld a világmindenség középpontja, és a Nap, Hold és a bolygók a Föld körül keringenek. A bolygók pályája kör alakú, és a csillagok rendszere a görög csillagászatból származik.\n\nKopernikusz elmélete szerint a Nap a világmindenség középpontja, és a bolygók keringenek körülötte. A bolygók pályája is kör alakú, és a csillagok rendszere a heliocentrikus rendszerből származik.\n\nTycho de Brahe a Nap körüli bolygók pályájának vizsgálatával próbálta bizonyítani a földközeli bolygók keringési modelljét. A pályák ellipszisek, és a csillagok rendszere a tychonikus rendszerből származik.\n\nKepler szerint a bolygók pályája ellipszis alakú, és a Nap a pálya egyik fókuszpontjában helyezkedik el. A csillagok rendszere a kepleri rendszerből származik.\n\nA Mars pályája mindegyik rendszerben ellipszis alakú, melynek geometriai neve is ellipszis. A Föld, Hold és Nap pályája pedig a különböző rendszerekben eltérő alakot ölt, a Ptolemaioszi rendszerben kör, a Kopernikusz rendszerben kör, a Tychonikus rendszerben ellipszis, a Kepleri rendszerben pedig szintén ellipszis.\n-----\n9. • Mit gondolt Eudoxosz, Kepler, Descartes, Newton ill. Einstein arról, milyen hatások tartjákpályájukon a bolygókat? Mindegyik estben 1-1 mondatban ismertesse az alapgondolatot, és utaljonarra, milyen pontossággal lehetett ezek alapján visszakapni a megfigyelési eredményeket!\nEudoxosz szerint a bolygók mozgását egymásra ható gömbök rendszere határozza meg. Kepler szerint a bolygók keringési pályája ellipszis alakú, és a Nap a középpontban van. Descartes szerint a bolygók mozgását az őket körülvevő éter hajtja, amelynek áramlása határozza meg a pályájukat. Newton szerint a bolygók mozgását a gravitációs vonzás határozza meg, amely az égitestek tömegének és távolságának függvénye. Einstein szerint a bolygók mozgását az űr-idej görbülete határozza meg, amelyet az égitestek tömege és sebessége okoz. Az alapgondolatok pontosságát a megfigyelések és a matematikai számítások egyre növekvő pontossága bizonyította.\n-----\n10. • Ismertesse a Föld forgása és Nap körüli keringése megismerésének történetét! (Kik és miértállı́tották az ókorban és a középkorban, hogy mozog a Föld? Milyen szakmai okokból vetették elsokáig a gondolatot? Ki és hogyan mutatta meg, hogy a Föld mozgása nincs ellentétben a mindenna-pi tapasztalatokkal? Milyen kı́sérleti bizonyı́tékok születtek a Föld mozgására?)\nAz emberiség évszázadokon át próbálta megérteni a Föld mozgását és a Nap körüli keringését. Az ókori görögök már megfigyelték, hogy az égitestek mozognak az égen, azonban csak a középkorban kezdtek el komolyabban foglalkozni a Föld mozgásával. Galileo Galilei és Johannes Kepler voltak az elsők, akik tudományos alapokra helyezték a heliocentrikus modellt, amely szerint a Nap a középpontban van, és a Föld kering körülötte. Azonban csak Isaac Newton gravitációs elmélete adta meg a teljes magyarázatot a Föld mozgására és a Nap körüli keringésére. A kísérleti bizonyítékok közé tartozik például a Foucault- inga, amely megmutatta, hogy a Föld forgása miatt az inga rezgéssíkja változik.\n-----\n11. • Ismertesse az elméletek lényegét, amivel Arisztotelész, Newton illetve Einstein azt a jelenségetmagyarázta, hogy egy elengedett kődarab lefelé esik!\nArisztotelész szerint a földnek a középpontja van, és az anyagok törekednek a középpont felé. Ez azt jelenti, hogy ha egy kődarabot elengedünk, akkor az lefelé fog esni, mert a föld a középpont felé húzza. \n\nNewton az általános gravitációs törvényt alkotta meg, amely szerint két test közötti vonzás erőssége a tömegük és távolságuk függvényében változik. Ez az összefüggés azt jelenti, hogy ha egy kődarabot elengedünk, akkor a föld vonzása miatt gyorsulni fog, és lefelé fog esni. \n\nEinstein relativitáselmélete szerint az idő és a tér nem szétválasztható fogalmak, és a gravitáció egyenértékű a tér görbületével. Ez azt jelenti, hogy ha egy kődarabot elengedünk, akkor a föld által okozott tér görbületébe esik, és ezáltal lefelé fog mozogni. \n\nMíg Arisztotelész és Newton klasszikus, newtoni fizikája elvei az anyagi világ leírására korlátozódnak, addig Einstein relativitáselmélete az univerzum egészére vonatkozik, és az idő és tér viszonyát is figyelembe veszi.\n-----\n12. • Írja le, milyen jellegű volt az ókori görög, egyiptomi és mezopotámiai számjelölés! (A használtjelek fajtái, a jelek értékét meghatározó tényezők, az összeadás és a szorzás elvégzésének nehéz vagykönnyű volta. A konkrét, lexikális dolgokat nem kell tudni, pl. hogy pontosan milyen jelük volt azegyiptomiaknak a 100-ra vagy hogy mennyi volt a görögöknél a η számértéke.)\nAz ókori görög, egyiptomi és mezopotámiai számjelölés különféle formákat öltött. A görögök használták az első tíz számot, amelyeket az α, β, γ, δ, ε, ϛ, ζ, η, θ, ι betűkkel jelöltek. Az értékeket a helyi számrendszer alapján határozták meg, amelyben a számjegyek helye határozta meg az értéküket. Az egyiptomiak hieroglifákat használtak, amelyeknek az értékei eltérőek voltak az arab számoktól. A hieroglifák általában állatokat vagy növényeket ábrázoltak, és az értékeik az adott hieroglifa pozíciójától függtek. A mezopotámiaiak a mai napig használták a hatvankettes számrendszert, amelyben hatvankét különböző szimbólumot használtak. Az összeadás és szorzás elvégzése mindhárom rendszerben hasonlóan történt, azonban a hieroglifák használata miatt az egyiptomi rendszerben az összeadás és szorzás elvégzése sokkal bonyolultabb volt.\n-----\n13. • Ismertesse a főbb állomásokat, hozzávetőleges időpontokat és személyeket, akik a Newtontörvények mai alakjának kialakı́tásában részt vettek!\nA Newton-törvények kialakításában számos személy részt vett, akik közül néhányan kiemelkedő szerepet játszottak. Az angol fizikus, matematikus és csillagász, Sir Isaac Newton volt az, aki az alapvető törvényeket megfogalmazta. Az első törvényt, a lendületmegmaradás törvényét már Galileo Galilei is felfedezte, de Newton pontosította. A második törvény, az erő és a tömeg kapcsolatát leíró törvény kialakításában a francia matematikus, Pierre-Simon Laplace is részt vett. Végül a harmadik törvény, az akció-reakció törvénye a német matematikus és fizikus, Johann Bernoulli munkájának eredménye. Az alapvető törvények kialakítása sok más tudós munkájára is támaszkodott, így a Newton-törvények kialakítása igazi közös munka eredménye.\n-----\n14. • Ismertesse a középkori mechanika főbb eredményeit (Galilei előttig)!\nA középkori mechanika főbb eredményei közé tartozik az arisztotelészi tudományos modell elfogadása, amely a természetet négy elemre, földre, vízre, levegőre és tűzre osztotta. Az arisztotelészi tudományos modell azt állította, hogy az objektumokat a terhek mozgatják és hogy a mozgás a természetes állapot. Az arisztotelészi mechanikai modell a középkor végéig meghatározó volt, és csak a Galilei által végzett kísérletek és a Kepler által végzett csillagászati megfigyelések vezettek a modern mechanikához. Más középkori mechanikai eredmények közé tartozik a középkori mérnöki munka és az építészeti tervezés fejlődése, amely lehetővé tette a középkori épületek és hidak építését. A középkori mechanika továbbá fontos szerepet játszott a középkori gépek és eszközök fejlesztésében, amelyek a mezőgazdasági munkát és a gyártást segítették elő.\n-----\n15. • Ismertesse Galilei csillagászati munkásságának főbb eredményeit!\nGalilei Galileo az egyik legnagyobb csillagászati ​​tudós volt a történelemben. Ő volt az első, aki egy csöves távcsövet használt, amely lehetővé tette számára, hogy közelebb hozza a távoli objektumokat. Galilei felfedezte a Jupiter négy holdját, amelyeket a Galilei-satelliteknek neveztek el róla. Ő volt az első, aki bemutatta, hogy a Napnak vannak foltjai, és a Holdnak hegyei és völgyei vannak. Galilei továbbá kifejlesztette a matematikai módszereket a gömbbel kapcsolatos problémák megoldására, és megfogalmazta a lendület megőrzésének törvényét is.\n-----\n16. • Ismertesse vázlatosan (név, időpont, a jelenség rövid leı́rása) a Föld forgása és Nap körüli keringésemellett szóló kı́sérleti bizonyı́tékokat!\n1. Foucault-inga (1851): A francia fizikus, Léon Foucault készített egy ingát, amelynek egyik végére egy nehéz ólomgolyót erősített, a másik végét pedig szabadon hagyta. Az ingát megindítva megfigyelte, hogy az ólomgolyó úgy mozog, mintha a Föld forogna alatta. Ez az inga azóta is az egyik legismertebb bizonyítéka a Föld forgásának.\n\n2. Coriolis-erő (1835): A francia matematikus, Gaspard-Gustave de Coriolis felismerte, hogy egy forgó testre ható erő változtatja meg annak mozgását. Ezt az erőt Coriolis-erőnek nevezik, és a Föld forgása miatt kelet-nyugati irányban hat. Ez az erő befolyásolja a légkör és az óceánok mozgását, és a légköri jelenségek, mint például a hurrikánok, tornádók vagy a passzátszelek kialakulásában is fontos szerepet játszik.\n\n3. Foucault-féle csillagászati teleszkóp (1889): Az amerikai csillagász, Simon Newcomb készített egy olyan teleszkópot, amelyet a Föld forgása miatt kellett két tengely mentén mozgatni, hogy a csillagokat pontosan kövesse. Ez a teleszkóp azóta is használatban van, és a csillagászatban fontos szerepet játszik.\n\n4. GPS rendszer (1978): A Global Positioning System (GPS) a Föld körüli műholdak segítségével határozza meg a földi helyzetet. A műholdak a Föld keringési pályáján mozognak, és a Föld forgása miatt a műholdak és a földi pozíciók relatív mozgása ismeretében a rendszer pontosan meghatározza a földrajzi koordinátákat.\n\n5. Az Eötvös-effektus (1908): Az Eötvös Lóránd által felfedezett jelenség azt mutatja, hogy a Föld forgása miatt a nehéz és könnyű testek közötti gravitációs erő kicsit eltérő. Ez az eltérés a földrajzi szélesség függvényében változik, és az északi és déli féltekék között is eltérő. Az Eötvös-effektus azonban csak nagyon érzékeny mérőműszerekkel mutatható ki, és a mindennapi életben nem jelentős.\n-----\n17. • Foglalja össze Kopernikusz munkásságát! (Előzmények, kinek a munkájára támaszkodott, mibenlépett túl rajta, milyen erényei és hiányosságai voltak modelljének összehasonlı́tva a ptolemaioszirendszerrel, mennyire tudta állı́tásait bizonyı́tani.)\nKopernikusz munkája a csillagászat és az asztrológia terén hozott forradalmi változásokat. Kopernikusz úttörő munkája az, hogy a Napot helyezte a világegyetem közepére, míg a Föld kering körülötte. Ez a heliocentrikus modell forradalmi változást hozott a korábbi földközpontú ptolemaioszi rendszerhez képest.\n\nKopernikusz munkájára több előzmény is volt, amelyek között szerepel a görög filozófusok munkája, a középkori arab és európai tudósok munkája, valamint a reneszánsz kor művészete és tudománya.\n\nA Kopernikusz-féle rendszernek azonban voltak hiányosságai. Például nem tudta megmagyarázni a bolygók mozgását, és nem volt képes megjósolni a csillagászati eseményeket pontosan. Ugyanakkor Kopernikusz munkája nagy hatással volt a későbbi tudósok munkájára, és a modern csillagászat alapjainak tekinthető.\n\nBár Kopernikusz nem tudta teljes mértékben bizonyítani állításait, mégis nagy hatással volt a tudományos gondolkodásra és a világnézetre. A tudományos kutatások és a technológia fejlődése azóta is alapvetően az ő munkájának köszönhető.\n-----\n18. • Magyarázza el, miért támasztotta alá a Nap-középpontú világkép igazságát az, hogy Galileitávcsövével észrevette, hogy a Vénusz a Holdhoz hasonló fázisokat mutat!\nA Nap-központú világkép alátámasztásában fontos szerepet játszott Galileo Galilei megfigyelése, hogy a Vénusz a Holdhoz hasonló fázisokat mutat. Ez azt jelentette, hogy a Vénusz is bolygó, és nem a Föld középpontja körül kering, ahogy azt korábban gondolták. Galileo megfigyelései rámutattak arra, hogy a Nap a középpont, és a bolygók keringése körülötte történik. Ez az előzőleg elfogadott földközpontú világkép ellen szólt, és alátámasztotta a Nap-központú világkép igazságát. Galileo munkája nagy hatással volt a modern csillagászat és asztronómia fejlődésére.\n-----\n19. • Ismertesse az 1300-as évek Európájában a mechanika elméletében felfedezett fontos eredményeket.(Az elméletek kiindulópontja, javı́tási kı́sérletek, a grafikonrajzolás jelentőssége, Oresmius és Buri-dan főbb eredményei.)\nAz 1300-as években fontos eredmények születtek a mechanika elméletében. A kiindulópontot Arisztotelész uralta, aki az egyszerű gépek és mozgások elméletével foglalkozott. Az alapelveket későbbi tudósok, mint pl. Jean Buridan és Nicole Oresmius továbbfejlesztették, és javítási kísérleteket végeztek a mozgásokkal kapcsolatban. A grafikonrajzolás jelentősége is felismertetett, amely lehetővé tette az időbeli változások ábrázolását. Buridan és Oresmius főbb eredményei közé tartozik a szabad esés és az impulzus fogalmának kidolgozása.\n-----\n20. • Mohamed ibn Musa al-Khwarizmi korszakalkotó könyvének cı́me: Hiszab al-dzsebr w’al mukaba-lah. Ismertessen 1-2 mondatban legalább három olyan fontos matematikai módszert vagy elnevezést,mely ezen keresztül terjedt el Európában.\nMohamed ibn Musa al-Khwarizmi könyve, a Hiszab al-dzsebr w’al mukaba-lah (A kifejezések helyreállítása és egyenlővé tétele) az arab matematika egyik legjelentősebb alkotása, amely jelentős hatást gyakorolt a nyugati matematikai gondolkodásra is. A könyvben bemutatott matematikai módszerek közül a legismertebb talán az algebrai egyenlet megoldására szolgáló eljárás, amelyet az arab szó al-jabr alapján \"algebra\"-nak nevezünk.\n\nA könyvben található egyéb fontos matematikai eljárások között említhető a számjegyek helyi értékének használata, amely az arab számjegyek elterjedésének elősegítésével nagyban hozzájárult a modern matematika kialakulásához. Ezen kívül al-Khwarizmi az elsők között írta le a negatív számokat és a tizedestörteket is.\n\nAz al-Khwarizmi által kidolgozott matematikai módszerek az arab világban és Ázsiában hamar elterjedtek, majd a középkori Európában is nagy hatást gyakoroltak. A könyv latin fordítása, a Liber algebrae et almucabala néven vált ismertté Európában, és nagy hatást gyakorolt a reneszánsz matematikusokra, többek között Leonardo da Vincire és Girolamo Cardanora. Az algebrai egyenlet megoldása és a számjegyek használata azonban nem csak a matematikában, hanem az informatika és a fizika területén is alapvető fontosságú eljárások.\n-----\n21. • Newton II. törvényét ma az F = m · a alakban ı́rjuk fel. Ismertesse ennek történetét!(Mozgástörvény az ókorban, középkori próbálkozások, az impetus fogalma és fontossága, Newtoneredeti törvénye, a mai alak kialakulása.)\nA Newton II. törvénye az erő fogalmát és hatását írja le a testre. Az ókorban már felmerült a mozgástörvények kérdése, de csak a középkorban kezdtek megjelenni az első próbálkozások. Az impetus fogalma volt az első kísérlet a mozgás törvényeinek megértésére. Newton az impetus helyett az erő fogalmát alkalmazta, és ezt az eredeti törvényét a mai alakjában írta le. Az F = m · a formula azt jelenti, hogy az erő hatása arányos a test tömegével és gyorsulásával. Ez a törvény az alapja a dinamikának, és az egész fizika számára fontos alapelv.\n-----\n22. • Ismertesse vázlatosan a fény sebességével kapcsolatos főbb kı́sérleteket, méréseket az 1600-asévektől az 1800-as évek végéig! (Név, időpont, a mérés elve 2 mondatban; legalább 3 kı́sérlet.)\nAz első kísérletek között volt az az 1600-as években végzett kísérlet, amelyet Galileo Galilei végezett. Ő azt vizsgálta, hogy a gyertyafénynek van-e sebessége, és arra a következtetésre jutott, hogy igen, de ennek a sebessége túl kicsi ahhoz, hogy mérhető legyen. \n\nA következő jelentős kísérlet a 17. században a dán Christiaan Huygens nevéhez fűződik, aki az elsők között mérte meg a fény sebességét. Huygens a Jupiter és annak holdjai közötti távolságot mérte meg, majd azonos időpontban azonos távolságból figyelte a Földről a Jupiter fényeit. Megállapította, hogy a Jupiter fényeinek késése akkor a legnagyobb, amikor a Föld a Jupiter és a Nap között van, és ezt a késést a fény sebességére visszavezette. \n\nAz 1700-as években Rømer, aki Huygens tanítványa volt, továbbfejlesztette a kísérletet. Ő szintén a Jupiter és annak holdjai között mérte meg a fény sebességét, de pontosabb eredményre jutott, mert figyelembe vette a bolygók mozgását is. \n\nAz 1800-as években Foucault végzett nagy jelentőségű kísérletet, amelyben egy forgó tükör segítségével mérték meg a fény sebességét. Foucault azt tapasztalta, hogy a tükör forgási sebessége hatással van a fény útjára, és ez alapján számította ki a fény sebességét. \n\nAzonban az első pontosabb mérést 1887-ben Michelson és Morley végezték el interferometriás kísérletükkel, amelyben egy Y alakú interferométert használtak. Az eredményük nagyon közel állt a jelenleg elfogadott értékhez, és ez alapján vált az 1887. évi Michelson-Morley-kísérlet egyik legfontosabb kísérleti bizonyítékává az általános relativitáselméletnek.\n-----\n23. • Kiknél és mikor fordult elő a fény hullámtermészetének gondolata? Ki igazolta először kı́sérletilegés fűzött hozzá helyes magyarázatot?\nA fény hullámtermészetének gondolata az 1800-as évek végén kezdett el terjedni a tudományos közösségben. Az első ember, aki kifejlesztette ezt az elméletet, Thomas Young angol tudós volt. Az 1801-ben végzett \"kettős rés\" kísérletével megmutatta, hogy a fény hullám jellegű lehet. Ezt később Augustin-Jean Fresnel francia fizikus is megerősítette, amikor a fény terjedését vizsgálta. James Clerk Maxwell skót fizikus később kifejlesztette az elektromágneses hullámok elméletét, amely magyarázatot adott a fény terjedésére is. A fény hullámtermészetének gondolata a mai napig alapja a fizikában és számos területen alkalmazzák.\n-----\n24. • Foglalja össze 10–15 mondatban Newton optikai munkásságát!\nIsaac Newton az optika területén végzett jelentős kutatásokat, amelyek közül a legfontosabb a fehér fény szétbontása szivárványra. A kutatásai során megfigyelte a fény törését és tükröződését, valamint a színképződést. Először a prizmát használta arra, hogy szétbontsa a fehér fényt a színekre. Ezen kívül kidolgozta a reflektorok és lencsék tervezését is, amelyek ma is használatosak. Newton elméleti és kísérleti kutatásai a modern optika alapjait teremtették meg.\n-----\n25. • Foglalja össze vázlatosan a fénysebesség mérése történetének főbb állomásait! Névvel, közelı́tődátummal és a mérés elvének 1–2 mondatos ismertetésével kell egy sikertelen, kezdeti próbálkozás,az első sikeres fényebességmérés, egy olyan mérés, mely a Földön elvégezhető volt és egy tetszőlegesmásik.\n1. Az első, sikertelen kísérlet a fénysebesség mérésére 1676-ban történt, amikor Ole Rømer dán csillagász megfigyelte, hogy a Jupiter és annak holdjai néha korábban vagy később kelnek fel, mint amire számított. Rømer felismerte, hogy ez a földi pályánk változó távolsága miatt van, és megpróbálta meghatározni a fény sebességét ennek alapján, de eredményei nem voltak pontosak.\n\n2. Az első sikeres fénysebesség mérés 1849-ben történt, amikor Hippolyte Fizeau francia fizikus és Jean Bernard Léon Foucault francia fizikus két kísérletet is végrehajtottak. Az egyikben egy forgó fogaskerék mögé helyezték a fényforrást, a másikban pedig a fényt egy tükörön keresztül visszaverődő útra küldték. Mindkét kísérlet eredményei hasonlóak voltak, és megmutatták, hogy a fény sebessége nagyon közel van a jelenleg elfogadotthoz.\n\n3. Az első olyan fénysebesség mérés, amelyet a Földön végeztek, 1879-ben történt, amikor Albert A. Michelson és Edward W. Morley amerikai fizikusok egy interferométert használtak. Az interferométer az általuk kifejlesztett Michelson-Morley-kísérlet alapjául szolgált, amely az éter létezésének megcáfolására irányult. A kísérlet eredményei megmutatták, hogy a fény sebessége nem változik az évszakok függvényében, amely ellentmondott az éterelméletnek.\n\n4. Azóta sok más fénysebesség mérés történt, többek között a lézerrel mérés, a Hubble-űrtávcső használata és az atomóra alapú mérés. Ezek a kísérletek még pontosabb eredményeket szolgáltattak, és hozzájárultak a relativitáselmélet fejlődéséhez és megértéséhez. A fénysebesség mérése továbbra is fontos szerepet játszik a modern fizikában és az űrkutatásban.\n-----\n26. • Ismertesse vázlatosan (név, időpont, a felfedezés lényege) a fény hullámtermészete megis-merésének történetét. (Első ötlet, egy sejtés, direkt kı́sérleti bizonyı́ték, pontos matematikai leı́rás,teljes fizikai magyarázat.)\nA fény hullámtermészetének megismeresére vonatkozó első ötlet a XVII. szazadban merült fel, amikor is Robert Hooke brit tudós azt javasolta, hogy a fény áramlás, amely szemmel nem látható hullámok formajában terjed. Azonban csak az 1801-ben végzett Thomas Young brit fizikus kı́sérletei bizonyı́tották, hogy a fény valóban hullámokban terjed. Young kı́sérleteiben két szűk nyı́láson keresztül irányı́totta a fényt egy falra, ezzel hozva letré a hullámok interferenciáját. Ezt követően Augustin-Jean Fresnel francia fizikus matematikai leı́rást adott a fény terjedésének hullámmodelljére. A teljes fizikai magyarázatot azonban James Clerk Maxwell skót fizikus adta meg a 19. szazad elején, amikor kidolgozta az elektromágnesesség elméletét, és rájött, hogy a fény is elektromágneses hullám.\n-----\n27. • Rene Descartes és Pierre Fermat egyaránt megadott egy-egy elvet, ami a fény törését meghatározzaés mindegyikük levezette belőle a fénytörés törvényét. Ismertesse a két alapelvet, mutassa ki, hogykövetkezik belőlük a fény közeghatáron való megtörésének jelensége. Milyen különbség van a kételmélet között a fény terjedési sebessége vonatkozásában? Melyiknek van igaza?\nRene Descartes elve szerint a fény mindig a legrövidebb útvonalon terjed, ami azt jelenti, hogy a fény útja egyenes vonalú, amíg a közeg homogén. Pierre Fermat elve szerint a fény útja mindig a legrövidebb idő alatt történik meg, ami azt jelenti, hogy a fény útja görbe vonalú lesz, ha a közeg törésmutatója nem homogén. A fehér fény áthaladása során a különböző hullámhosszú összetevők eltérő mértékben törnek meg, és ez okozza a szivárvány színeit. A közeghatáron való megtörés jelensége az első alapelv és a második alapelv együttes hatása. A két elmélet közötti legfontosabb különbség az, hogy Descartes elmélete csak az egyenletes közegre vonatkozik, míg Fermat elmélete a nem homogén közegre is érvényes. Mindkét elméletet elfogadják a fizikában, és azokat különböző körülmények között alkalmazzák. Így nincs olyan döntő igazság, hogy melyiknek van igaza, mindkettőt fontosnak tartják a fény terjedésének megértéséhez.\n-----\n28. • Ismertesse Fermat-nak a fénysugarak terjedésére vonatkozó elvét! Mutassa meg (számolás nélkül),miért következik ebből, hogy a fény egy homogén közegben egyenes vonalban terjed, de vı́zbenlassabban halad, mint levegőben! Milyen korábbi fényterjedési elméletnek mondott a Fermat-elvellent? Ismertesse ezt is röviden!\nFermat az elve szerint a fény egyenes vonalban terjed a homogén közegben, és mindig a legrövidebb úton halad, azaz a legkisebb idő alatt éri el a célját. Ez az elv magyarázza, hogy miért lassabban halad a fény a vízben, mint a levegőben, mivel a víz sűrűbb közeg, így a fénynek több akadályt kell legyőznie, hogy elérje a célját.\n\nA korábbi fényterjedelem elmélete az aether-elmélet volt, amely szerint a fény egy aether nevű közegben terjed, amely mindenhol jelen van az univerzumban. Az aether-elmélet szerint a fény terjedése hasonló a hang terjedéséhez a levegőben, azaz hullámok formájában. Azonban az aether-elmélet nem volt képes megmagyarázni bizonyos kísérletek eredményeit, és végül a speciális relativitáselmélettel együtt elvetették.\n-----\n29. • Ismertesse Young interferencia-kı́sérletét! (Előzmények, elképzelések a fény természetéről akı́sérlet előtt, a kı́sérlet lényege, fogadtatása, utalás további interferencia-kı́sérletekre.) )\nYoung interferencia-kísérlet a fény hullámtermészetének bizonyítékaként szolgált. A kísérletet Thomas Young angol fizikus végezte el 1801-ben, és azt mutatta be, hogy a fény hullámtermészetű. A kísérlet során egy oszcilláló fényforrásból származó fénysugarat két vékony széles nyílásra irányították, amelyek között egy vékony fénysáv jött létre. A fénysáv a két nyílás fénysugarainak interferenciájából eredt. Az interferencia-kísérletet sokan elutasították a kezdetben, mert a korábbi elképzelések szerint a fény részecske természetű. A kísérlet eredményei azonban végül elismerték a fény hullámtermészetét, és további interferencia-kísérletek követték.\n-----\n30. • Írja le részletesen, mivel magyarázta Fresnel azt, hogy a fény iránya a levegő-üveg határonmegváltozik. Miért mondta Fresnel, hogy a fény az üvegben lassabban megy, mint levegőben?\nFresnel azzal magyarázta, hogy a fény iránya a levegő-üveg határon megváltozik, hogy a két közeg közötti határfelületen a fényhullámok szétválnak, és egy része áthalad az üvegbe, míg a másik része visszatér a levegőbe. Azt is megfigyelte, hogy az üvegben a fény lassabban halad, mint a levegőben, és ennek oka az üveg sűrűsége. Az üveg molekulái közelebb helyezkednek el egymáshoz, így a fényhullámoknak több anyagot kell áthaladniuk, és ez lassítja a mozgásukat. Fresnel elméletét később az optikai törvényekkel is alátámasztották, és az ma is az optikában használatos alapvető ismeretek közé tartozik.\n-----\n31. • Ismertesse az áram- vagy feszültségforrásként szolgáló legfontosabb berendezéseket röviden, felfe-dezővel és (hozzávetőleges) időponttal a kezdetektől a 19.szd. végéig!\nAz egyik legfontosabb áramforrás a Volta-cella volt, amelyet Alessandro Volta olasz fizikus talált fel 1800-ban. Ez az első elektromos elem volt, amely képes volt állandó feszültséget biztosítani. A feszültségforrások közül a legfontosabb az elektromos generátor, amelyet Michael Faraday angol fizikus fejlesztett ki 1831-ben. Az elektromos generátorok lehetővé tették a nagyobb mennyiségű elektromos energiatermelést. A dinamók és a turbina-generátorok a 19. század végén jelentek meg. Az elektromos motorok közül a legelső a Faraday-féle homopólus motor volt, amelyet 1821-ben találtak fel, és amely az első olyan motor volt, amely elektromos árammal működött. A telegraf az 1830-as években jelent meg, és lehetővé tette az elektromos kommunikációt hosszú távolságokon.\n-----\n32. • Ismertesse az elektromágneses hullámok alapjelenségeinek megismerésének történetét! (Alapötlet,elméleti magyarázat, kı́sérleti bizonyı́ték névvel, időponttal, 2–3 mondatos ismertetővel.)\nAz elektromágneses hullámok alapjelenségeinek megismerése több évszázados kutatás eredménye. Az alapötletet már Faraday és Maxwell dolgozta ki a 19. században, akik a mágneses és elektromos erőtér közötti kapcsolatot vizsgálták. Az elmeleti magyarázatot Maxwell fejlesztette ki, aki megmutatta, hogy az elektromos és mágneses mezők változása hullámokat generál. Az első kísérleti bizonyítékot Heinrich Hertz mutatta be 1887-ben, amikor elektromágneses hullámokat állított elő és érzékelte azokat. Az időpontok között a legjelentősebb 1920, amikor a rádió kommunikáció elterjedése lehetővé tette az elektromágneses hullámok használatát az élet minden területén. Ma az elektromágneses hullámokat a mobiltelefonok, a rádiók, a televíziók és a számítógépek használják.\n-----\n33. • Ismertesse, kik, mikor és milyen formulába foglalt alaptörvényt fedeztek fel az elektromos ésmágneses terekkel kapcsolatban! (Nem ide tartozó név, felfedezés: pontlevonás!)\nAz elektromos és mágneses mezők közötti kapcsolatot az elektromágneses indukció törvénye írja le, amelyet Faraday fedezett fel 1831-ben. Ennek értelmében egy mozgó mágneses mező egy vezető körül kelt elektromos áramot. Az elektromágneses indukció törvénye azonban csak a változó mágneses mezőkre vonatkozik, és nem magyarázza meg az állandó mágneses mező hatását. Ezért vezettek be egy új fogalmat, az elektromos fluxust, amelyet Gauss talált ki. Az elektromos fluxus azt méri, hogy mennyi elektromos töltés halad át egy adott felületen. Az elektromos fluxus és a mágneses mező közötti kapcsolatot végül a Maxwell-féle egyenletek foglalták össze, amelyeket James Clerk Maxwell állított fel a 19. században. Ezek az egyenletek a klasszikus elektromágneses elmélet alapjai, és az elektromos és mágneses mezők dinamikáját írják le.\n-----\n34. • Ismertesse az elektromos és mágneses terek alapegyenleteinek felfedezésének történetét!(Előzmények vázlatosan: az elektro- és magnetosztatika alapösszefüggéseinek felfedezése; az in-dukció felfedezése; a Maxwell-egyenletek felı́rása; Maxwell saját, elméleti felfedezése; az elekt-romágneses hullámok.)\nAz elektromos és mágneses terek alapegyenleteinek felfedezése sok évtizedes kutatás eredménye volt. Az elektro- és magnetosztatika alapösszefüggéseinek felfedezése során olyan tudósok játszottak fontos szerepet, mint Coulomb, Gauss, Ampère és Faraday. Az indukció felfedezése és az elektromos áramok terjedésének vizsgálata vezetett a Maxwell-egyenletek felírásához, melyek összefoglalták az elektromos és mágneses terek viselkedését. Maxwell saját, elméleti felfedezése az elektromágneses hullámok létezését bizonyította, melyek később a rádió és a kommunikáció alapjává váltak.\n-----\n35. • Miért merült fel az 1800-as évek végén az abszolút vonatkoztatási rendszer létezésének gon-dolata? Milyen kı́sérleteket (legalább 2 független kı́sérlet) végeztek ennek kimutatására az akkoriszázadforduló környékén? Mi volt a kı́sérletek eredménye? Miért hozta ez zavarba a fizikusokat?\nAz abszolút vonatkoztatási rendszer létezésének gondolata az 1800-as évek végén merült fel, amikor a fizikusok rájöttek, hogy a fénysebesség mindig ugyanolyan sebességgel mozog, függetlenül attól, hogy milyen irányból érkezik. Ennek kimutatására legalább két független kísérletet végeztek az akkori időkben, amelyek közül az egyik Michelson-Morley kísérlet volt, amelyben az éter keresésére használtak interferométert. A másik kísérletet Kennedy és Thorndike végezte el, amelyben a föld körül keringő eszközt használták a sebességmérésre. Az eredmény mindkét kísérletben az volt, hogy nem sikerült kimutatni az abszolút vonatkoztatási rendszer létezését, ami zavarba ejtette a fizikusokat, mivel az Newton-féle mechanikai elméletet alapjaiban rengette meg.\n-----\n36. • Sorolja fel a legfontosabb kutatókat, akik a speciális realtivitáselmélet elméleti alapjainak le-rakásában kulcsszerepet játszottak. Röviden ismertesse, ki milyen részéhez járult hozzá az elméletnekelsősorban. (Legalább 4 név.)\nAlbert Einstein a speciális relativitáselmélet megalkotója volt, aki az idő és a tér viszonyát vizsgálta. Ő állította, hogy a fény mindig ugyanazon sebességgel halad, függetlenül attól, hogy milyen irányban és milyen sebességgel mozog a forrása. Hermann Minkowski matematikus hozzájárulása pedig az volt, hogy az idő és a tér összeolvadását tette lehetővé a négydimenziós tér-idő fogalmával. Hendrik Lorentz fizikus a Lorentz-transzformációk kidolgozásával járult hozzá a relativitáselmélet fejlődéséhez. Max Planck pedig az elektromágneses sugárzás kvantumelméletének kidolgozásával járult hozzá az elméleti fizika általános fejlődéséhez, amely a relativitáselméletet is megelőzte.\n-----\n37. • Írja le, milyen kı́sérleteket, megfigyeléseket magyarázott meg az általános relativitáselmélet utólagés milyeneket jósolt meg előre, melyeket később igazoltak. (Legalább 2–2 példa rövid leı́rással.)\nAz általános relativitáselmélet Einstein által kidolgozott elmélet, amelynek alapjai a gravitációt tekintik. Az elmélet számos kísérleti bizonyítékát mutatta be, amelyek közül az egyik a 1919-ben végrehajtott napfogyatkozás megfigyelése volt. Az elmélet előrejelzte, hogy a Nap tömegének hatása torzítani fogja a körülötte levő csillagok fényének útját, amelyet a megfigyelők az esemény során észleltek. Egy másik példa a gravitációs vöröseltolódás jelensége, amelyet az általános relativitáselmélet előre jelezte. Ez a jelenség azt mutatja, hogy az objektumok, amelyek közelebb vannak a nagy gravitációs erőt kifejtő objektumokhoz, lassabban mozognak, ami a fény hullámhosszának növekedéséhez vezet. Az általános relativitáselmélet számos további kísérleti bizonyítékát is bemutatta, amelyek közül sokat a modern technológia segítségével végeztek el, például a gravitációs hullámok megfigyelése.\n-----\n38. • Ismertesse a Michelson és csapata által végzett interferométeres fénysebességmérések lényegét!(Milyen előzményei voltak? Mi volt a mérés alapötlete? Milyen eredményt vártak a méréstől? Ho-gyan tért el ettől a mérések eredménye? Miért okozott ez problémát az akkori fizikában? Milyenelmélet adta meg végül a magyarázatot?)\nMichelson és csapata az interferometria segítségével végeztek el precíz fénysebességméréseket. Az előzménye az volt, hogy 1887-ben Michelson és Morley kísérletezők azt állították, hogy a létező éterhullámokat nem lehet érzékelni, amely ellentmondott a korábbi fizikai elméleteknek. A Michelson által kifejlesztett interferometria lehetővé tette a fényhullámok közötti kicsi különbségek észlelését. A cél az volt, hogy mérjék a földi körüli pályán mozgó Föld sebességét az éterhez viszonyítva. Az eredmények azonban nem mutattak semmilyen sebességváltozást, ami ellentmondott az általánosan elfogadott éterelméletnek. Ez problémát okozott az akkori fizikában. Végül Albert Einstein speciális relativitáselmélete adott megfelelő magyarázatot az eredményekre.\n-----\n39. • Ismertesse a Michelson-Morley kı́sérletet! Írjon a kı́sérlet közvetlen előzményeiről, a mérés céljáról,a használt eszköz alapgondolatáról, a méréssorozat eredményéről és utaljon arra, milyen elmélet ki-fejlődéséhez szolgált közvetlen alapul ez a mérés.\nA Michelson-Morley kísérlet egy olyan kísérlet, amelyet azért végeztek el, hogy megvizsgálják, hogy a Föld sebessége befolyásolja-e az elektromágneses hullámok terjedési sebességét. A kísérlet célja az volt, hogy meghatározzák a \"lumen eter\" sebességét, amely egy hipotetikus közeg volt, amelyben az elektromágneses hullámok terjednek. \n\nA kísérlet során a Michelson és Morley által kifejlesztett interferométert használták, amely két tükörből és egy fél átlátszó tükörből állt. Az alapgondolat az volt, hogy ha a Föld sebessége befolyásolja az elektromágneses hullámok terjedési sebességét, akkor az interferométerben megfigyelhető lenne egy eltérés.\n\nAz eredmény azonban az volt, hogy semmiféle eltérés nem volt megfigyelhető, ami azt jelentette, hogy a Föld sebessége nem befolyásolja az elektromágneses hullámok terjedési sebességét. Ez az eredmény a számos fizikai elmélet fejlődéséhez vezetett, és közvetlen alapot szolgált az Einstein által kidolgozott speciális relativitáselméletnek.\n-----\n40. • Írja le a Bohr-féle atommodell alapgondolatait és vázlatos történetét! (Melyik atommodell javı́tásáratalálták ki, mik az alapelvei, milyen téren volt sikeres és milyen téren sikertelen?)\nNiels Bohr dán fizikus a hidrogén atomjának szerkezetét vizsgálva alkotta meg a Bohr-féle atommodellt 1913-ban. Az alapelvei szerint az atommag közepén helyezkedik el a pozitív töltésű protonok és a neutrális neutronok. Az atommag körül elektronok keringenek különböző energiaszinteken. Az elektronok csak bizonyos energiaszinteken lehetnek, az alacsonyabb szinteken stabilabbak. Amikor az atomok energiát kapnak, az elektronok magasabb szintekre ugranak, majd visszatérnek alacsonyabb szintekre, kibocsátva az energiafelesleget foton formájában. A Bohr-féle modell az első olyan modell volt, amely magyarázatot adott a hidrogén spektrumára, de nem volt alkalmazható több elektronos atomokra. Az atomfizika fejlődésével azonban kiderült, hogy a valóság bonyolultabb, és a kvantummechanika terén kellett új elméleteket kidolgozni.\n-----\n41. • Foglalja össze, hogyan ı́rja le a Schrödinger-féle kvantummechanika egy elektron mozgását!(A hullámfüggvény foglama, szemléletes jelentése, a hullámcsomag közepének mozgása, azállapotfüggvény-redukció.)\nA Schrödinger-féle kvantummechanika egy elektron mozgását a hullámfüggvény segítségével írja le. A hullámfüggvény egy matematikai fogalom, mely azt mutatja meg, hogy az elektron hol lehet a terben. A hullámfüggvény szemléletesen olyan, mint egy hullám, amelynek magassága és alakja megmutatja az elektron valószínűségét, hogy hol lehet. A hullámcsomag közepének mozgása az elektron mozgása, melynek sebességét és helyzetét a hullámfüggvény határozza meg. Az azállapotfüggvény-redukció azt jelenti, hogy amikor az elektron megfigyelésre kerül, akkor az állapota megváltozik, így az előzőleg meghatározott helyzet és sebesség már nem pontos.\n-----\n42. • Ismertesse részletesen azt a kı́sérletet, melyben Rutherford és társai kimutatták az atommag létét!(Mi volt a kı́sérlet célja? Milyen eszközöket használtak? Hogyan tért el az eredmény a várakozástól?Miért következett ebből az atommag léte?)\nErnest Rutherford és munkatársai célja az volt, hogy megvizsgálják az atom szerkezetét. A kísérlet során alfa-részecskéket lőttek egy aranyfólia felé, és megfigyelték, hogy hogyan terjednek át rajta. Az eszköz, amelyet használtak, a rácsos katódcsövet tartalmazta, amely lehetővé tette az alfa-részecskék kibocsátását. Az eredmények azonban meglepőek voltak: az alfa-részecskék egy része egyenesen áthaladt a fólián, míg mások hirtelen irányt változtattak vagy visszapattantak. Ennek eredményeként Rutherford és munkatársai arra a következtetésre jutottak, hogy az atomok középpontjában az atommag létezik. Ez az eredmény nagy hatással volt az atomfizikára és az atommodellezésre.\n-----\n\n\n"
}